{"author": "猫叔．", "content": "我奶是得癌症去世的，老爸对癌症有阴影。记得初中的时候，就在他的藏书中看到过一本《如何预防癌症》，可见吓得不轻。这两年，他开始对自己的寿年和健康重视起来……大年初一晚上，老家的堂叔发来视频和老爸拜年，平日不常联系，一聊聊了很久，聊到最后，老爸突然问起堂叔当年两个经常在一起喝酒的好友李叔和谢叔的近况，堂叔说，都去世几年了，一个食道癌，一个胃癌……老爸哦哦地应着……也不知道那晚老爸心理阴影面积有多大……", "link": "https://www.qiushibaike.com/article/124079841"}
{"author": "撞死一只羊", "content": "今天相亲了一个老师，散场的时侯她说:你的情况我了解了，过两天我会通知你的家长", "link": "https://www.qiushibaike.com/article/124098838"}
{"author": "红尘一笑醉红颜～", "content": "大外甥二十岁，小外甥八岁。大的不好好上学，不务正业败了好多前，姐姐姐夫拼命的赚前，说两个儿子都要娶媳妇。小家伙说前都让哥哥花完了我怎么办，我不管我也要娶媳妇，我不要太大的，给我娶一个十四五岁的就行，太大了我怕我打不过她.....", "link": "https://www.qiushibaike.com/article/124097691"}
{"author": "逍遥花落人不知", "content": "我二大爷是属于酒仙级别的，不喝酒啥地里活不干，喝了酒跟上了发条似的。有一回可能是喝过量了，晚上七点多头戴头灯刨了半亩地玉米茬子，亮天回家倒头就睡，睡一天晚上醒来问我们，艾玛呀浑身疼呀，你们是不是趁我喝多了打我了", "link": "https://www.qiushibaike.com/article/124023034"}
{"author": "璃白°", "content": "老公的大姐回娘家，跟我们发牢骚，说大姐夫的工资卡明明在她身上，昨天收拾衣柜的时候，竟然发现大姐夫，偷偷藏了几千块私房钱，也不知道这些钱哪里来的。老公说道：大姐你是不是傻啊？现在很多单位，工资是打到卡上，但奖金都是发现金。等大姐回家后，我一言不发、死死的盯着老公，这货面红耳赤，讪讪的从沙发下面，掏出一个黑色塑料袋。", "link": "https://www.qiushibaike.com/article/123917979"}
{"author": "狐地瓜大人", "content": "老婆会经常推送给我一些文章，讲解某某东西好，就是暗示我她喜欢这个，赶紧买。今天老婆又推给我一篇文章，我想看看老婆关注的啥公众号，推送的都是老婆喜欢的东西，我点开公众号，发现公众号是老婆开的，我又把之前老婆推送给我的文章点开，果然，所有文章都是她自己用公众号推送的…", "link": "https://www.qiushibaike.com/article/124098962"}
{"author": "璃白°", "content": "老公醉醺醺的回家，进门嬉皮笑脸道：老婆老婆，我一看见你，就食欲大增。我本来还在生气，听到这话娇羞道：老公，是不是因为我长得漂亮，秀色可餐。老公摇摇头：不是，因为你长得圆圆的，活像一个土包子。", "link": "https://www.qiushibaike.com/article/124041950"}
{"author": "狐地瓜大人", "content": "跟老婆分工，我负责做饭，她负责洗碗。后来老婆不想洗碗，买了一次性餐具，让我用一次性餐具盛饭菜。有天媳妇吃着饭说：“要不你还是用正常的碟子碗吧，用一次性餐具吃饭，总感觉得自己在吃外卖”刚洗了两天碗，老婆正式通知我：“你还继续用一次性餐具吧，之前剩下的没用完，别浪费了！！”", "link": "https://www.qiushibaike.com/article/124095752"}
{"author": "吃了两碗又盛", "content": "美女们要打麻将，我媳妇和我外甥女都没有零钱，我给她俩一人拿一百块。麻局结束，媳妇跟我汇报战果:我赢了五块钱，你输了三十，外甥女替你输的。[大笑]这难道是传说中的躺输吗？", "link": "https://www.qiushibaike.com/article/124095730"}
{"author": "花开二零二一", "content": "在老丈人家用餐，头发有点长，拨了一下，老婆不满道：“真失礼，头发长就去理啊！”我辩解道：“都向你提了几次了，你都没给我钱去理。”老丈人啪的一声拍在桌子上，指着老婆道：“到底谁失礼啊？他堂堂七尺男儿，居然连理个发都得向你要钱，其是岂有此礼！走！爹带你去理发！老婆子，你看这可以给我一百不？”", "link": "https://www.qiushibaike.com/article/124098473"}
{"author": "骑着二哈啃黄瓜", "content": "现有公司待久了，过完年就想换新的公司，抱着你试试看的心里，透了两家感觉匹配度比较高的公司。其中一家几轮面试后，那天管我的上司出差不在，最后老板直接面试的。入职报道到那天，人事领我去办公室时，，惊艳到我了，好家伙，我以前的上司，很大一部分同仁还是我以前下属。。。", "link": "https://www.qiushibaike.com/article/124099408"}
{"author": "爱上钓鱼的猫", "content": "初二，丈母娘把一枚硬币包进饺子里，说谁吃到给一千元红包。大家早有准备，小姨子拿出手持探测器，老婆掏出强力吸铁石……我手疾眼快，抓起一个饺子塞进嘴里，然后吐出一枚硬币，得意地炫耀着。小姨子说：姐夫，你作弊！吃一个饺子就能吃到硬币？哪有这样的好运气？她们不信，继续用工具探测，也各自找到了硬币。饺子里只有一枚硬币，现在三个人都吃出硬币，一定有两个人是假的！就在我们相互指责的时候，丈母娘端着一盘饺子进来，我们让她评评理。丈母娘放下饺子，淡淡地说：你们太着急了，包着“硬币”的饺子，在我这盘里…查看全文", "link": "https://www.qiushibaike.com/article/124070291"}
{"author": "狐小乔", "content": "电疗颈椎，电疗仪在中间，我和一个老头左右躺好。医生说，如果觉得自己能适应，就调整旋钮，加大电量！十分钟后，我调了，没感觉，再调，再调！嗯，我挨骂了，老头坐起来骂我：你个小瘪犊子，你要电死我啊，你调你的呗，调我的嘎哈！", "link": "https://www.qiushibaike.com/article/124095682"}
{"author": "天然呆。oO", "content": "亲戚送来只老母鸡，这玩意我也不会收拾呀，怎么办呢，瞄到一旁正在玩电脑的老公，诶！忽然想到个好办法。“老公你骂我一顿呗？”“啊？我没听错吧？”“真的，你没听错。你骂我一顿，这样我就不怕杀鸡了，我就当是在杀你”老公。。。", "link": "https://www.qiushibaike.com/article/124097625"}
{"author": "骑着二哈啃黄瓜", "content": "发小真是太过分宠你女友了，一道正月不剃头理发的，发小才不管这些，带着女友就奔向理发室。我见面就笑他:有了异性没人性？他一脸奈何:可能大过年的营养太好了，女友头发疯长，把焗黑油过的白发苍苍露出来了。。。", "link": "https://www.qiushibaike.com/article/124095601"}
{"author": "正版煮茶", "content": "表弟开了个奶茶店，看别人的店丝袜奶茶卖的好，他也去买了几双丝袜，扔给店长：你今天带大家做丝袜奶茶，要给顾客一个震撼的感觉！店长：我不会做！表弟：我也不会，丝袜奶茶来自香，港，你看多几部港片学着做！我下午路过他奶茶店，看到全体店员，头套着丝袜，翻着鼻孔在那等生意，场面十分震撼...", "link": "https://www.qiushibaike.com/article/124080669"}
{"author": "璃白°", "content": "这边的疫情不严重，大街小巷好多不戴口罩的人，我习惯了戴口罩。这不，在电梯里，不知谁放了个无声的屁，都说响屁不臭，臭屁不响。看大家都捂着鼻子，我庆幸自己戴了口罩。可能是太臭了，有个男的吼道：谁啊？吃了什么东西？妈的太臭啦！电梯里大家面面相觑，我旁边一个小朋友拉着我衣角说：阿姨，是不是你放的屁啊？你戴着口罩，是不是早就做好准备了?", "link": "https://www.qiushibaike.com/article/124058486"}
{"author": "璃白°", "content": "过年回到老家，恰逢奶奶生日，晚上一大家子人吃过饭后，我坐到一旁拿起手机打游戏。奶奶走过来说：真羡慕你们这个时代的人，哪像我们那时候，晚上电都没有。我好奇的问道：奶奶，你们那时候晚上没电，吃过晚饭后，有什么娱乐节目啊？奶奶竟然脸红了，训斥我道：你这小妮子问那么多干嘛？能有什么节目，吃过饭就睡觉。这时，我爸过来叫我：就知道玩手机，快点，去帮你十个叔叔，每人泡一杯热茶。", "link": "https://www.qiushibaike.com/article/124072337"}
{"author": "叶落紫枫", "content": "“给你介绍个男朋友吧，就是比较胖。”“啊，胖还是算了吧。有多胖？”“以前开卡宴，最近嫌挤，要换悍马才行。”“你凭啥说我老公胖！”", "link": "https://www.qiushibaike.com/article/124095288"}
{"author": "无书斋主", "content": "咳咳咳，我忍无可忍的咳嗽声又惊醒了熟睡中的老婆和一岁多的儿子！……这娘们没说给我倒杯热茶，反倒一脸嫌弃：老头，你这是得了痨病啊，睡客房去吧，别传染给我和宝宝了……我特么，真想两脚踹死她……吃完晚饭，搞完卫生，我在沐浴之时，这娘们竟然关我的热水，还娇滴滴：老公，你要锻炼身体，电视里面都是洗冷水的，我老公也行的哦！……这大冬天的洗冷水澡，一洗还半个小时，我能不感冒吗？！………", "link": "https://www.qiushibaike.com/article/123944432"}
{"author": "忧郁的创可贴", "content": "“我袜子呢？找了一早上了！”“我哪儿知道。没看见！”“你张嘴我看看……”", "link": "https://www.qiushibaike.com/article/124095485"}
{"author": "红尘一笑醉红颜～", "content": "经常遛弯的一处路边是鸟的天堂，每到傍晚时分成千上万只的鸟儿归林叽叽喳喳叫个不停，今天傍晚路过那里发现没有一只鸟叫声，奇怪的问老公：你说这些鸟都哪去了啊……他不假思索地回答：可能都回老家过年去了……", "link": "https://www.qiushibaike.com/article/124051701"}
{"author": "狐小乔", "content": "之前一起做招聘的同事给我打电话，说：“你们公司现在不错，你自己发展怎么样啊？”这前同事目前做了猎头，她这一问我以为她想要帮别的公司挖我。内心狂喜的我想着是不是要夸张点说现在的工作有多好，没准能找到一个好待遇的公司。还没组织好语言呢，就听对方说：“你看看能不能把我内推到你们公司啊？”", "link": "https://www.qiushibaike.com/article/123961872"}
{"author": "给国军太太送个信", "content": "刨出一件古老的衣服穿起来，觉得口袋里边好像有纸片，心中暗喜——原来我也会留了钱在口袋里边儿。掏出来一看，不是钱。但也可以算钱吧——是张借条。想了一下，还是不能算钱，白开心了。借款人是老婆。借款时间是刚认识她不久。", "link": "https://www.qiushibaike.com/article/124053622"}
{"author": "程念念念", "content": "小侄子上一年级，老师要求每天睡前阅读，再拍个短视频发群里。他们班有一个同学刚开始每天都坐在钢琴旁边阅读，这两天天冷了，开始坐在床上阅读了，每次他阅读的时候，床上不是放个LV的包包，就是放个宝马的车钥匙。", "link": "https://www.qiushibaike.com/article/123965890"}
