{"author": "狐小乔", "content": "大学四年，宿舍里的某位同学从没买过卫生纸卫生巾什么的，每次都是用室友的，宿舍里怨声载道。我们一商量，决定治一治她的坏毛病，大家把卫生纸都藏起来，她上厕所时找不到纸，急得跟什么似的。看她真急了，我说：“二手的纸你用吗？”她高兴地说：“可以！哦……什么叫二手的纸？”我：“我用过的。”她骂了一句，然后大叫一声：“来不及了。”匆忙中抓了两张打印纸冲了出去。那是两张《学生情况调查表》，晚上找辅导员要新表，辅导员说：“每人只有两张表，没有富裕的……”"}
{"author": "夲少姓〖劉〗", "content": "吃过晚饭，陪着老婆刷手机，里边突然传出一段语音“全国70%的男人都渴望有婚外恋”听完老婆瞅了我一眼，我赶紧表决心，老婆放心吧我绝对是剩下的那30%，然后就听到语音后半段，剩下的30%已经有了婚外恋[捂脸][捂脸][捂脸]老婆你再给我个机会[衰][衰]"}
{"author": "金枪十一少", "content": "上高中的时候，学校不准谈恋爱，可是有一天我们班班花在打开他男朋友送她的礼物的时候，被老师看到了，在老师的严刑逼供下，她竟然说是我，我解释了好久，班主任就是不信，最后教导主任说“整个年级，所有男生只有你能配的上她，不是你，还能是谁”！"}
{"author": "为什么账号都已存在…", "content": "院长的母亲子宫瘤，做切除手术。主任一进门就说，同志们，院长的老窝被我们端啦。"}
{"author": "『空欢喜』", "content": "我家就两姐妹 ，妈妈说以后要招个上门女婿 ，由于我是姐姐，大妹妹2岁，这个重担就交到我身上啦 。我和妈妈都看上隔壁村的一个小哥哥，还是个穷小子的，由于他家三兄弟，他们父母也想让他们做谁的上门女婿。经过的双方父母同意，我两留了联系方式，我比较热情，他比较木纳，主动跟他说:我们先试着谈恋爱。他循循善诱劝解我:你年龄太小，我比你大8岁，我不能伤害你。。。这过年放假回家，然而姻缘天注定，我们终究还是成为一家人。他已经决定入赘我家，并且下个礼拜，他就\n…\n查看全文"}
{"author": "夏有凉风秋望月", "content": "小时候，我有个梦想，就是长大后能当个作家，像冰心，鲁迅谁的，写遍各个领域，翱翔于文字当中，博览群书，没事和三五个好友一起品茶聊天！夏天吹着空调啃西瓜，冬天涮个火锅拉个呱……小日子过的舒坦，有滋味！满足啊！……“望月，你的 值 日 表该交了！这个不和谐的声音，打断了我所有的遐想！就不能等我做完梦吗？哎，不说了，老板又来了，我打扫卫生去了！"}
{"author": "夏有凉风秋望月", "content": "前一段时间买了一瓶撕拉式手膜，用了一次，涂上去的时候还是 挺 舒 服的，清清凉凉的感觉，等到撕的时候，汗毛都撕下来了，疼的我再也没用过！昨天晚上我突发奇想，脚上没有汗毛，应该可以当脚膜用吧！于是我就涂了上去，等到 膜 干了 往下撕的时候把我脚的干皮都撕下来了，特么的疼死我了！比撕汗毛还疼！我再买这种手膜，谁是狗狗！"}
{"author": "狐地瓜大人", "content": "办了张洗车卡，洗车工是一老大爷，颤颤巍巍的洗车，车子没洗干净，也不好意思让老大爷返工。我开车离开，想着用完卡以后再也不来了。最后一次洗车时是一漂亮妹子接待的，妹子不仅干活麻利而且特会聊天，忽悠我又续办了洗车卡！再来洗车时，洗车工又变成了之前的老大爷…"}
{"author": "正版煮茶", "content": "我小时候住亲戚那，冬天脚底皮多，我找了一把阳台晾晒的塑料锉子，上面有凸起点，搓起来脚挺好使。搓完放回原处。吃饭时，我才知道那是饭勺..."}
{"author": "南九", "content": "今天早上刘主任给大家发口罩。咯咯咯……发到最后还剩两盒。刘主任在办公室喊:还有谁没领口罩的，赶快来领！喊了半天，还是没有人来领，刘主任一边收拾一边叨咕:总有这脑袋让驴踢的人，干啥都慢，吃 💩都赶不上热乎的......老赵凑过去:刘哥，你自己的领了么？刘主任一愣，低头夹着口罩上楼了……"}
{"author": "花开二零二一", "content": "朋友离了，带个女儿六岁，我问她以后有何打算？她答：做单 亲妈妈，现在每天运动，好好带她，等她上大学了，我就找她的大学同学当男朋友，不错。"}
{"author": "衣锦夜行的小王子", "content": "八岁小外甥跟我说，他喜欢上了一个小女孩。我问他你知道什么是喜欢吗？他说：我不喜欢胖的但她胖就没事"}
{"author": "吃了两碗又盛", "content": "我家的防盗门因为里面的那一侧插了钥匙，在外面插钥匙就插不到位，门就打不开。找了开锁师傅，这种情况他也是头一次遇到，最后没办法暴力破拆，防盗门损毁严重。我儿子平时就挺爱惜东西，这次他目睹拆门的全过程，痛惜地说:家门不幸，家门不幸啊！"}
{"author": "老毛的酒", "content": "我和媳妇正在吃晚饭媳妇：哎～我得少吃点，最近胖了很多，睡觉打呼噜，自己都能感觉到[笑哭]我：嗨～没关系的媳妇，很多女人睡觉都打呼噜[嘿嘿]媳妇：[挖鼻孔][挖鼻孔][挖鼻孔][挖鼻孔]哎[发呆]楼道里有点冷[发呆][发呆][发呆]"}
{"author": "吃了两碗又盛", "content": "准备明天去上坟，买了些金纸折元宝，折到一多半的时候我儿子回来了，就让他帮忙。儿子看了看说:够了，不能再折了，元宝多了那边该通货膨胀了。"}
{"author": "逍遥花落人不知", "content": "所有成功的人都是八面玲珑的，说话左右逢源，而不成功的人说话能呛别人一跟头，而我属于后者。在某地上班的时候，春天女上司挖了不少野菜，其他人说:“原来 领 导 身材这么好是跟吃绿色无公害食品有关系，怪不得越来越青春靓丽了。而我说到:“挖这么多野菜喂猪呀，然后就没有然后了"}
{"author": "夏有凉风秋望月", "content": "今天去逛街的时候，看见对面走过来一个打扮怪异的女子，我看了好久，没想到她居然主动过来，跟我说，合照吗？我愣愣的点了一下头，心想，她怎么知道我要拍照呢？拍完照以后，她居然回手就是一巴掌过来，看够了吗？如果你敢发 朋友 圈，你就死定了！果然，怪异的女子脾气也是怪异的……"}
{"author": "吃了两碗又盛", "content": "我媳妇干活快，但比较毛糙。昨天大扫除她打碎了两个碗，擦坏了一个水龙头。没什么好说的，买新的，旧的不去新的不来！后来都收拾利索了，我去洗澡，我媳妇突然说要给我搓澡擦背，被我严词拒绝了，闹啥闹，我还想多活两年呢！"}
{"author": "冬天里的小燕", "content": "：儿子和土匪有很多相同点：第一、他们都会把你攒了大半辈子的钱洗劫一空；第二、他们都会威胁你，信不信我让你断子绝孙；第三、他们都是在缺钱的时候，才想起你，然后，给你打电话，让你把钱给他打过去。当然儿子和土匪还是有区别的：那就是被土匪抢走的钱，警察可以帮忙追回来，而被儿子抢去的钱，派出所都不受理！"}
{"author": "吃了两碗又盛", "content": "儿子说想玩手机，我拒绝说玩什么手机！儿子又说想玩电脑，我本来想说玩什么电脑写作业去！但说急了两句话并成了一句话:写什么作业！"}
{"author": "双眼皮的兔子", "content": "去年快过年的时候我堂姐的儿子找我借了300块钱钱不多    我也没当回事今天给他发信息 问他啥时候回来过年才发现他不知道啥时候已经把我删掉了[捂脸][捂脸][捂脸]这是个啥情况？？"}
{"author": "『空欢喜』", "content": "跟男朋友谈了两年恋爱，还是分手了，分手时特别伤心，难过，就去喝酒买醉。然后偶遇现在的老公，认识几天就在一起了，一个月不到就怀孕了，然后结婚。孩子出生以后，大家都说不像我老公，只有一点点长得像我。不过老公太爱我跟孩子了，一点都不怀疑，我算了算日子，我也不好意思说孩子提前两个礼拜出生的。"}
{"author": "李辉a", "content": "公司一天只用工作5个小时，有双休，而且工资8000块钱。这段时间公司裁员，经理把我叫到了办公室。我当时就慌了，他跟我说：你对现在的工作满意吗？我急忙拍马屁：满意，相当的满意，经理英明神武，跟着你干绝对有前途。经理听完乐坏了，拍着我肩膀说：好好干，也没什么事，就是心情不好，听你拍拍马屁，平复一下心情。"}
{"author": "空城旧梦她与伞", "content": "刚进初中时，第一节体育课，老师是一个很阳光帅气的小伙子，他对我们说：我很反感把体育课变成文化课，或者让学生自习，这是不负责任的。我们不但要学习好，也要健康的身体，只要我一天是你们的体育老师，我绝不允许其它老师霸占体育课。我们是欢欣鼓舞啊，确实整个初中一年级，我们每节体育课都没落下。谁知初中二年级时，学校来了一个年轻漂亮的女数学老师，几个月后，她把体育老师泡到手了，她只要嗲声嗲气叫一声老公，体育老师就乖乖投降，我们的体育课就全变成数学课了。到初三时，数学老师怀孕，要回家待产\n…\n查看全文"}
{"author": "中国加油！！", "content": "本人售票员，前几天比较空的时候，下午窗口没人。有个小孩儿趴在我柜台上玩笔，玩着玩着抬起头，伸手戳了戳玻璃，眨着水汪汪的大眼睛问我：“你为什么被关起来了？”我笑着对他说：“因为姐姐不好好读书。”他瘪瘪嘴：“你骗人。”我说：“真的，没骗你。”他摇头，很认真地反驳我：“你就是骗人，你明明是阿姨。”"}
{"author": "夏有凉风秋望月", "content": "我是一家公司的人事主管，领导让招聘着人才。今天老板问我:月月，最近新人招聘的如何呀！我自信满满的告诉老板:新进的职员我用很严格的超高标准，尤其是女职员。老板两眼放光说:太棒了，那应该招进来的美女不少吧！我一脸抱歉的说:没有一个符合要求。老板一脸茫然的问:纳尼？你采用了什么超高标准？那么严格？她们必须比我胖，才算合格。"}
{"author": "大小可爱爱爱", "content": "那年在内 蒙 矿上，工作闲暇之余，喜欢上附近一开小店的蒙 古美女！喜欢到什么程度呢？茶不思饭不想！睁眼是她，闭眼是她！尤其她的 笑更是让人难以忘怀！终于有一天，我壮着 胆买了一大束鲜花前去表白，看到她穿着民族服装，头戴花冠，骑着一匹高头大马，乍一看就像剧中一位美丽动人的公主！来不及多想，于是单膝跪地，喊到：**美女，我喜欢你很久了，为你茶不思饭不想，今生非你不娶，请问你愿意嫁给我吗？美女略邹了一下额头，大声说：嫁！然后那匹马驼着她一溜烟似的扬长而去……"}
{"author": "北堂灵梦", "content": "声明一下，这是一件真实的糗事。初中时一同桌，他特别爱睡，一上课就睡觉，有一次我突然摇醒他，告诉他快跑！学校着火了，当时他的反应我一辈子都忘不了，裤子一脱在全班人眼前尿了一泼尿在衣服上，披着衣服就他妈往外冲，还不停的说卧槽卧槽……"}
{"author": "《龙妹妹》", "content": "不知道你们接到推销电话是怎么处理的？反正又不需要我的电话费，我是接了不说话，静静的听着你的演讲表演！刚刚，就刚刚！听着声音非常甜美的美女客服打电话给我。喂…您好，我们是某某公司，某某楼盘，最近新推出了一个楼盘，在某某位置  等等………喂，你听得到吗？怎么不说话呀？是手机有问题，还是我说话声音有点小？我再给您重新介绍一下这个新楼盘！我们这个楼盘依山傍水，交通便利，名校入驻…………喂喂喂，你怎么还不说话呀？最后这位美女跟同事说了一句，这个DIAO  MAO  不说话的！然后就把电话挂了\n…\n查看全文"}
{"author": "坏小孩cium", "content": "年关将至，结婚的特别多。一个不太熟的远房的表哥打电话来，说结婚伴郎数不够，让我客串一下伴郎。这是人提出的要求么？请我吃饭行，让我一个黄花大闺女去当伴郎？！？！！      重赏之下必有勇夫，我去了，一整天下来娘家人没有任何人发现破绽，甚至还有俩小姑娘要加我微信。。。。"}
{"author": "《龙哥哥》", "content": "背景:续前两天写帖脸被猫抓花了以后，心情有点低落。今天提了两瓶好酒，去找老泰山喝两杯！敬酒的时候看见老泰山手上有抓痕，就问老泰山怎么回事？泰山:被猫抓的，我说你什么时候养猫了？没想到老泰山居然反问我 :你养猫了吗？……我……养了！！……"}
{"author": "十里柔情一帘幽梦", "content": "刚刚看到一个脸型完美比例的标准，偷偷拿尺子量了，然后兴奋地说：我脸型比例是最完美的，完全符合标准！同事们都不相信，离我最近的小张伸头看了一眼，对大家点点头：她对照的是男人的标准！"}
{"author": "冬日阳光温馨", "content": "下雪了，还是好大的雪，和老婆浪费下。把姥爷的摇椅拿出来，老婆坐上我推，好开心的。突然来了个电话，接了几分钟，再推，推不动了，冻着了。我说老婆你也动动啊，这事整的。老婆动了，一阵风吹来之后。"}
{"author": "大小可爱爱爱", "content": "临近过年，又到了回家逼着相亲的时候！想起往年去女方家相亲点头哈腰的又发 烟来又发 糖，发到最后还是 黄！“烦 烦 烦”，于是给老爸打电话，赌 气的说相亲总是不成功太 烦 人了，今年不打算 回 家相亲了！老爸安慰道：你回来吧！放心！今年不逼 你相亲了！我纳闷的问道：真的？为什么？老爸：真的，连个给你介 绍媳 妇的都没有！去哪相亲？卧槽，更扎. 心了，一点希望也没了……"}
{"author": "大宝宝2016", "content": "同事有了二胎 老大三岁 因为怕老大无意伤害老二从来不让兄妹独处……直到有一天同时上完厕所 发现卧室门锁了。老大在卧室给老二换尿不湿，怕妈妈打扰"}
{"author": "骑着二哈啃黄瓜", "content": "发小从她得公司辞工了，回去地级市陪朋友和当地一些手机配件批发商代理商喝酒。。。酒过三巡，发小一直分享自己所在的公司的3c数码配件公司在品类管理，品牌管理和代工管理，质量管理体系和供应体系非常ok. 在交期支付和品质保证上独树一帜。酒过7巡，开始在交期评审，来料进度跟踪管控，生产进度管控上，qe ，iqc, ipqc, oqc，仓储物流配送时效上，异常时效管理上大吹大擂。。。然后当地一个一级代理对她讲的内容就很感兴趣，问她:有空能不能去你公司看看\n…\n查看全文"}
{"author": "时间的裂缝", "content": "有没有人小时候坐在澡盆里抓住澡盆边想把自己抬起来的？"}
{"author": "喂-你好吗", "content": "早上起来发现睡过头了，着急忙慌的穿衣服顺便拍醒了闺女闺女：睡迷糊了吧？今天星期六啊！：这熊孩子！你不用上学，我还是得上班的，这两天该你做饭了啊！闺女：今天早上我突然不想吃饭了：可是，我想吃啊！"}
{"author": "偷惢前男友", "content": "一直对家属直接的称谓在直系里面没有什么疑问以及三代以内的，在四代里的称谓就一直迷迷糊糊的，比如：01你爷爷的岳父叫什么02你妈妈的爷爷叫什么03你奶奶的妈妈叫什么04你外公的妈妈叫什么05你爸爸的外婆叫什么06你外公的爸爸叫什么07你外婆的爸爸叫什么08你外公的岳父叫什么09你外公的岳母叫什么10你奶奶的爸爸叫什么11你外婆的婆婆叫什么12你妈妈的外婆叫什么13你妈妈的外公叫什么14你外公的爸爸叫什么15你外公的妈妈叫什么16你外婆的妈妈叫什么17你爸爸的外公叫\n…\n查看全文"}
{"author": "夏有凉风秋望月", "content": "小的时候家里条件不大太好，为了让我好好学习，老妈把我转到了镇上的一个重点小学，老妈教育我说，不要跟别人攀比，要攀比就比学习成绩！更不要随便接受别人的东西，因为我们现在还 还不起！刚来到一个陌生的环境，我有些不知所措，一个短头发长的很秀气的女孩子主动让我跟她一起坐。并拿出来巧克力让我吃，记着妈妈的教诲，我拒绝了！后来，她把书包里的零食都拿给我，看着她满满的诚意，我俩就成最好的朋友！我发誓，我真的不是看好她的零食！"}
{"author": "筱悦吧", "content": "闺蜜说，越来越觉得老公那帮朋友让人厌烦，大男子主义爆棚，随时自信心满满。跟他们吃饭，那些男人就问她，担不担心老公跟年轻女员工出轨。她直接说：“这个我还真的没想过，我比较担心自己出轨。”全场哑口无言。。。"}
{"author": "忧郁的创可贴", "content": "准弟媳第一次来我家，饭后大家围坐沙发聊天。她讲起了童年趣事，提到小时候家里好几个果园，面积很大。。。后面讲啥我已经听不进去了，我着急的问道 : 现在这些果园还有吗？都有些什么果子？弟媳上下瞅我一眼，淡定说道 : 有，尤其是木瓜特别多。。。艾玛，这弟弟先不管，这弟媳我是要定了 ! ! !"}
{"author": "骑着二哈啃黄瓜", "content": "难得去逛街，看中一款新款绿色的暖冬帽，款式特别满意，就是价格45比较贵，我装着漫不经心的样子问老板:能便宜点么？老板心直口快:最后一件了，今年的爆款，40拿走吧。我心想就这破帽子，也那么贵？没关系，继续坐地还价呗，​这是旁边冲出一年龄少女伸手拿我手里的帽子:阿姨你这帽子不买吧？让我看看试一下可以吧。我一阵血气上涌,对着这姑凉:你喊谁阿姨呢？老板给我包起来！你要买就不让你买，丫头片子。买完单直接戴着帽子欢快的继续逛街。逛完一圈从街道另外一边​绕回来，\n…\n查看全文"}
{"author": "璃白°", "content": "小时候胆子特小，晚上睡觉时，听到一点动静，就钻进被窝，结果养成了蒙头大睡的坏毛病，书上也说这样睡觉不好，却总是改不了。直到前几年嫁人了，老公不抽烟不喝酒，却喜欢吃炒黄豆和烤红薯。半个月后，我就彻底改变了这个坏毛病。"}
{"author": "义行天下7", "content": "老婆 前不久把 工作 辞了！安心在家等着过年，每天打扮的花枝招 展的，精气 神十足！这 家 伙 可 把 我 给 折  .腾 累 够 呛的……"}
{"author": "胖香", "content": "闺女挺会规划零花钱的，给的零花钱大部分存起来，没事抠我的零食吃，我和我妈打算测试一下她，昨天告诉娃儿给她20块钱，但是不许放到存钱罐，只能花掉，看她能买什么回来。晚上回来的时候啥吃的玩的都没带回来，问她钱呢？人家拿出了个账本，仔仔细细的算账:“我同桌借了五块说买笔，明天还我的话五块五，超过3天还6块，小雅借了2块，到时候还我2块，因为她给我吃了个棒棒糖，还有别的借出去的钱我都记账了，大概算了一下，能赚七八块呢！明天还给我20么？我这生意挺好的！”"}
{"author": "净心居士", "content": "新谈了个女友胖丫，春节时候带她回家她见了家长。我父母对她很满意，临走时我爸把我拉到一边悄悄对我说:以后多穿纸尿裤吧！我好奇的说:我又不是小孩子，这点还把控不了了？于是我爸语重心长的说:我家祖传怕老婆，你小子又胆小，到时候我怕你吓了尿裤子。。。。。。我去，还是亲爸了解我[捂脸]"}
{"author": "上天揽九月、", "content": "闺蜜约我去看电影，到了电影院找到位子坐好。闺蜜在背包里掏出一大桶爆米花和一瓶可乐，递给我说：“电影院的零食贵死了，这是我在超市买的。”我怀着无尽的感动，一大口爆米花一口可乐，美滋滋看着电影，一桶爆米花快见底时，我问闺蜜：“你怎么不吃啊，都快被我吃完光了！”  闺蜜摇摇头说：“你吃吧，我怕胖！”我…草率了~"}
{"author": "、萍萍玉立～～", "content": "小时候去舅妈家，她和表弟在吃苹果。我眼巴巴地瞅着，舅妈却没分我一个。舅妈说：妞，你家穷，要是吃上瘾了，你妈供不起，咋办？我是哭着跑回家的，老妈一咬牙，买了一车苹果耀武扬威地来到舅妈家……那天舅妈家的冰箱，洗衣机被砸的坑坑洼洼，电视也被老妈用苹果砸的稀碎。如果不是舅舅及时拦着，估计现在只能去给舅妈上 坟了……"}
{"author": "狐地瓜大人", "content": "之前路边有卖炮仗的，老婆想买，被我忽悠一通，老婆没买。今天老婆抱回来一箱炮仗，问她：“你不是保证不买了？”老婆：“嗯，老家朋友说她们那炮仗可贵了，我准备买点给她寄过去,你猜怎么着？”  老婆停了停，接着说：“快递不让寄，你说气人不，我受不了这委屈，现在就把炮仗点了去！”"}
{"author": "再坏掐si你", "content": "记得大学时候，我们校卫队成员在教学楼住，那个楼就我们几个男生，剩下的全是女生，有天早上室友报告，说一楼男厕有女生出入，另外一室友说：真的，我特么都遇到几次了！给我整的好奇了！印象很深刻！记得那是个周五的早上7点多，校卫队成员一个没起来，我闹肚子拿起手机穿个内内就跑向厕所，正当我准备起身的时候，突然传来了脚步声，紧接着进了我旁边的卫生间，一时间勾起我的好奇心：隔壁是室友？还是女生？？于是拿起手机想借着屏幕反光看看…特么的、手滑了…手机掉厕所里了…所以每每想起来就纠结，隔壁到底是谁？害的\n…\n查看全文"}
{"author": "吃了两碗又盛", "content": "儿子要买航拍无人机，还缺点钱，跟他大姨说，他大姨立马给了他五百块压岁钱。儿子挺高兴，毕竟钱数比往年多了。但是有些事不在儿子的考虑范围之内，比如说我家只有一个孩子，大姨姐家俩孩子呢，"}
{"author": "璃白°", "content": "如花似玉的闺蜜结婚了，新郎是她一个网友，长得其貌不扬。我不解的问道：你喜欢他什么?闺蜜说：那晚和他聊天，我说在酒吧喝酒，他担心我出事，竟然从几十公里外开 车赶过来。我：哦哦，看样子对你是真心的，你应该是被你感动了吧。闺：对啊，还有一个原因，是他那台法拉利的副驾驶，坐起来真舒服。"}
{"author": "正版煮茶", "content": "最近写对联，儿子跟我讨了一副，说送人，增进友谊。我说要送给懂的欣赏的人。第二天，问儿子送谁了，儿子说送给他书法老师了。儿子，你这是踢馆行为知道吗？还增进友谊..."}
{"author": "千丝雨ベ万人迷", "content": "女同事结婚，我因刚失恋两个月，看不得这个，在婚宴上，忍不住快哭了，偷偷跑了出来。晚上，我看了下时间，十点多了，心想网恋了一个多月的他应该不会上线了吧，没多久，消息声传来，他说:刚下班，累死了，抱抱!我忍住了激动的泪水，回了一句话:死扑该，今天我去你婚礼了，没开美颜，你就认不出了我了么？？？"}
{"author": "坏小孩cium", "content": "小时候第一次看新白娘子传奇，我弟弟突发奇想，让小伙伴去抓蛇给他，他放生，等蛇修炼好了回来找他报恩。       嘉明这小子不老实，他抓完蛇没给我弟，自己偷偷的藏在了自己家水缸里，想要自己放生。后来玩忘了，他妈妈回来拿水瓢舀水，突然窜出一条蛇，他妈妈嗷呜一声就吓晕过去了。        那天晚餐他们家吃的是蛇粥，住在隔壁的我都闻到了，艾玛，真香～"}
{"author": "夲少姓〖劉〗", "content": "早上买早点时，看到牌子上写着：皮蛋瘦肉3米3，我还跟着读了出来。然后那店主说：帅锅不好意思，这是皮蛋瘦肉粥！额～[捂脸][捂脸][捂脸][捂脸][捂脸][捂脸]"}
{"author": "璃白°", "content": "和闺蜜逛公园，逛累了就坐在公园的石凳子上，零食放在石桌上。对面坐了一对母子，小男孩大概五岁左右，长得很可爱，他眼睛一眨不眨盯着我的零食。我连忙拿出一些给他，他妈妈看到，对小男孩说：快谢谢漂亮阿姨。小男孩想了想，对着闺蜜，奶声奶气说道：谢谢漂亮阿姨。"}
{"author": "图图的耳朵会动耶", "content": "年前置办了好几套新衣服，准备拜年穿。今年提倡就地过年，好多亲戚没回来，大年初一就把该拜的年都拜完了！在家实在无聊，就老去老妈家转悠，今天又穿得美美的去了，老妈看了我一眼：这是第四套了！你这是年拜完了，新衣服还没穿完，要穿着多拜几次啊"}
{"author": "捉女妖的天师", "content": "同事把他叔叔介绍到了我们工地干活，连人带铺盖一块接到了地方到了第三天晚上才突然发现还少拿好些个洗换用品同事：叔，我今天回家，你给我婶打个电话把所有的东西给你捎回来，最好春.夏.秋.冬的一块打包！他叔：你这是打算让我出家当和尚来了吧！"}
{"author": "逍遥花落人不知", "content": "我小表舅 结 婚 我舅老爷在城里给买了套房子。想着儿子结婚了把我太姥爷接过来住几天，毕竟老爷子也没去过几次县城。太姥爷在小表舅的小区里转转，看到个井盖跟我舅老爷说:“看来城里吃水真是方便呀随处都有井”。舅老爷说:“那是污水井”是处理污水的也就人们拉的 屎 尿 ，太姥爷想了一会说到:“那我们行走在屎尿上面，那我们是蛆吗"}
{"author": "『空欢喜』", "content": "最近几天天气鄹变，非常的阴冷刺骨。每天早起上班，一路都是寒风凛冽啊。今天早到办公室，就把空调打开，暖暖办公室，顺便吹着热风，甚是温暖啊。没有过一会，同事就陆陆续续的到来上班了。女同事小玲一进来就说：“哇，今天外面冷死了，这办公室好暖和啊，跟在被窝躺着一样舒服。”结果有个男同事说：“小玲啊，你家被窝有点大啊，躺这么多人。”于是我有点憋出内伤的想笑....."}
{"author": "忧郁的创可贴", "content": "去年疫情期间学会了打麻将，非常上瘾。就经常跟公司同事一起打，不知不觉中输了小一万块钱。男票知道后并没有责怪我，只是让我保证以后不再打麻将。我当时口头保证了，但心里不服气，经常想着该如何翻本。昨天男票出差，我觉得翻本的时候到了，就迫不及待跟同事小王几个又约在一起偷偷打麻将。            结果男票突然电话查岗，我情急之下脱口而出 : 我正在睡觉呢 ! 男票表示不信，我急了 : 你不信去问问小王，他就在我旁边呢 !然后电话就嘟嘟嘟。。。"}
{"author": "芭蕉窗下听雨声", "content": "前几天老公回来过春节了，可每天晚上的呼噜声此起彼伏。我几天几夜睡不着。于是他买了一瓶鼾立停回来。鼾立停的用法是给鼻子里喷几滴，然后用人家特治的封口贴把嘴巴贴上。可是这几夜他鼾声依旧。我忍不住就问了。他：嘴巴封住太难受......我：你要不封住嘴巴，我有袜子一夜安好。可我醒来一看，他嘴里含着我一袜子[笑哭][笑哭]"}
{"author": "a依然美好", "content": "给狗取名要趁小，我有个朋友养了一只狗，一直没决定叫什么名字。导致后来狗子长大了，坚定不移的认为自己叫“过来吃饭”。"}
{"author": "歌歌哒f", "content": "侄子和我女儿看我妈腌肉，我女儿：奶奶你在干什么？我妈：腌肉啊，女儿：那为啥用盐？我妈：用盐腌着就不会臭了啊，女儿似懂非懂的点了点头不一会侄子转身向厕所走去，女儿在厕所外喊道：哥哥你在里面干什么？侄子：拉粑粑，女儿：那你等我去给你拿盐巴，侄子在厕所回道：来不及了已经臭了……"}
{"author": "撞死一只羊", "content": "今天下年，坐在教室里，刚想动手拉前排女生的头发，突然想起来，我是来开家长会的。可可，时间好不经用，回头已是半生"}
{"author": "狐地瓜大人", "content": "我们每年去培训一次，这次我带队。报完到，教官问我：“那谁谁谁今年怎么没来？”我回答教官：“他离职了啊，上次培训完回去就离职了。”教官：“难怪，上次来 培训一起打 牌 赢了我好几千，还想等他来报仇呢！”我：呵呵呵…"}
{"author": "北堂灵梦", "content": "昨天点外卖无聊时突发奇想，“在备注上写要帅哥送。”结果到楼下取外卖的时候，快递小哥弱弱地问：“最帅的今天没上班，你看我，你满意吗？”😂😂😂"}
{"author": "晓来雾沾衣", "content": "老爹多年回忆道“那一刻，我仿佛成为了光”…“晓来，晓来，你在家吗？”…伴随着敲门声，女班长甜美的声音穿进我的耳膜…我急忙下炕，鞋都甩飞了一只，连跑带摔的赶紧去开门…开门的一刹，刺眼的光芒照射于我，眼前的女孩，是自带光环的天使，她每一次出现在我面前的时候，都会让我痴，让我醉，让我着迷…我倚在门口呆呆的望着她，她眼波流转，文静如水，光洁如玉的脸颊因天气寒冷的原因还带着一抹嫣红，她见我痴痴的看着她……不由的含羞一笑的说“看鸡毛撒（啥）看，赶紧让俺进去，俺找苏苏（叔叔），zeng\n…\n查看全文"}
{"author": "半截烟云", "content": "我哥读书时比我高一个年级。高三那年，我哥的好朋友复读时刚好和我同桌。他经常会偷偷瞄我，被发现后就会害羞的笑。有次我实在忍不住的问：为什么老偷偷看我，是不是喜欢我啊？他说：千万别误会，看到你就想笑，是因为想起你哥说的，你小时候，坐在地上摸鸡屎吃的样子！"}
{"author": "吃了两碗又盛", "content": "哥们养猪的，规模越来越大，必须要注册企业了。企业名称叫啥呢？哥们也没太多文化，就用自己的名字注册了，王龙生猪养殖场。"}
{"author": "骑着二哈啃黄瓜", "content": "闺蜜一临沂网友给她寄了陈桥酱菜，分量太多了，就带了一部分到食堂午餐分食。大家觉得好吃，就问闺蜜这叫啥菜？闺蜜用不飘准的普通话说:这是临沂(qi)酱菜!特定带来给大家一起品尝的。大家一听临期酱菜，脸色都不好看了，快过期了还拿来给我们吃，吐的吐，呕的呕​。闺蜜看着大家的反应，丈二摸不着头脑。。。"}
{"author": "红豆红黄豆滚", "content": "记得上高中的那一年夏天，一大帮男生正在浴室里洗澡，突然浴室里停电了，我们只好自娱自乐的冲着凉水澡，打着水仗，玩的正嗨时，突然尿意来袭，反正黑漆漆的神马也看不见，我就随便一尿，尿的正爽，黑暗中的室友兴奋的大喊到：来热水啦！然后……玛德，打滴挺疼的！[捂脸][大哭]"}
{"author": "『空欢喜』", "content": "接上次说他拒绝和我结婚后。第二年我就减肥成功，我嫁给了一个身材和他差不多的男生，生了个儿子健康又漂亮。有一次带老公孩子回娘家，碰巧他也在。只见发小对老公说：真羡慕你娶了个好老婆，还生了个这么漂亮的儿子。（我和他以前的事老公也知道）老公说：还是多亏你啊，曾经的你可以有，只是你不要，我只是要了你不要的而已，这时只见发小叹气说到：每个胖子都是潜力股，都怪我当年太年轻不懂事，草率了…"}
{"author": "撞死一只羊", "content": "正和我15岁的小女友手拉着手逛街，忽的出现一个满脸 凶 光的大汉，一手抓起我前 胸 的衣服，另一个葵扇大的巴掌就要扇过来，我心想完了，让她老爸抓观行了，闭着眼等揍吧！接下来不对头了，巴掌没扇下来，反而前 胸 上的手抓了两把，然后，她老爸脸上一红，道：“这位同学啊，你这里脏了！呵呵！两个姑娘家逛街逛开心点，这是两百，去买点喜欢的。呵呵。。”说完递过来两百，转身就走了！我嘘了一口气，心想要不是过年胖了十来斤，胸 肌又大了不少，绝对少不了一顿揍！！"}
{"author": "捉女妖的天师", "content": "我买的零食放在寝室总是莫名其妙的少，有时候我都没吃几口就没了后来我把零食分成两袋往桌子上一放直接挑明：同志们，咱们先来个君子协议，这一袋吃完剩下的另一袋你们可不许再打主意了啊！事实证明，她们根本不是君子是女人，草率了！"}
{"author": "千丝雨ベ万人迷", "content": "闲逛走进一个特产店，老板热情的和我介绍他家的特色。顺便聊了几句，发现他居然是我舅妈不同意的二表姐的男朋友。他激动不已，给我车里塞了好几件特产，自己人这些给你打五折就好，还反复嘱咐我，要给舅舅舅妈多美言几句。我看着这些本来不想买的东西，暗自叹了口气，算了钱就走。逛别的地方，才知道，这个可能未来的姐夫卖给我的东西，比市场价贵了三倍，大家说我现在能不能去退款？"}
{"author": "璃白°", "content": "我姥爷是村小学的民办教师，学生都是附近村子的。他教过的一个学生，读书时，成绩很差，到初中毕业后，就没再读了。他逢年过节都会提点东西，来探望我姥爷，农活忙的时候，也会主动来帮忙。我姥爷时常感叹，教过这么多学生，那些成绩好的，没一个来探望他，仗义每多屠狗辈，负心多是读书人啊。直到有一天，那学生向我姥爷提亲，说看上他小女儿了。没错，那学生就是我爸。"}
{"author": "坏小孩cium", "content": "邻居大姨和大姨父吵架了，大姨收拾了一个包，早上悄悄出了门，在站点处等客车准备离家出走，本来正常点的客车今天却晚点了，左等右等等不来，却等来了大姨父。大姨被大姨父撕撕巴巴的给拉回家了。原本考驾照考的灰心丧气的我在阳台看的若有所思，我得考驾照，必须得考下来，不然自己不会开车，想去隔壁村儿吃烤羊腿都赶不上热乎的。。。"}
{"author": "秋风吹豌豆", "content": "刚刚毕业找了第一份工作，中午的饭补是15块钱，那天中午领导检查食堂，顺带在食堂吃饭……我看着他们桌上的排骨流口水……脑子一抽跑过去问：“能给我吃一个么？”领导：“没事 吃吧吃吧……”我立马坐下来风卷残云，领导坐在那全程没动筷子……经理一直给我使眼色，我没反应过来，还说经理你也吃啊……第二天，我们的饭补从15块钱变成了25块钱了[笑哭][笑哭][笑哭][笑哭]"}
{"author": "倾心倾情%%", "content": "早晨二货打电话来说：想你了，刚才在地铁上看见个特像你的人，带着眼镜，拎着包，拿着手机正打电话！我暗喜地问道：那女人好看么？二货：不好看！"}
{"author": "鲁智深暴打达文西", "content": "看三国，贾诩毁了大汉，贾充毁了曹魏，贾南风毁了西晋，贾宝玉毁了林黛玉，那贾贵毁了侦缉队，就是想问一下，贾玲毁了啥？"}
{"author": "九头纪", "content": "上学的时候谈了一个男朋友，那时候我妈每星期都请我俩吃饭，一次去饭店的路上此男子在我妈面前装 萌 卖 苦 说：阿姨啊，你不知道我们寝室还有老鼠，巴拉巴拉。。。。语毕，我妈来了一句：有老鼠好啊，有肉吃！！当时此男子安静了。哈哈 ……老妈真可爱。"}
{"author": "狐小乔", "content": "普外。一jc叔叔被咬伤来就诊。我：怎么咬伤的呀？他：别提了，巡逻的时候，遇见一个大姐，遛狗不栓绳，我就过去jg她一下，胳膊就被咬了。我：哎呀，这狗还挺护主的呀！什么品种啊？他：就是小狗，泰迪。我：那这狗蹦得挺高啊，都快到肩膀了。他：是大姐咬的......"}
{"author": "坏小孩cium", "content": "老妈在家做了酱肘子，打电话叫我们回去吃，胖哥有工作走不开就说让我俩去吃。      我开车带着妞妞风驰电掣一路火花带闪电的到了我妈家。妈妈发现胖哥没来，就说：女婿没来，你就把肘子拿回去一起吃吧。      我开心的一蹦三尺高，抱着装好的肘子放车里，一脚油门开车就跑了。恍惚间听见我妈在门口大喊什么孩子孩子。可能是觉得我孩子气吧。。。"}
{"author": "聊天不撩妹子", "content": "外甥在一小厂做领导（说厂好听点，连他才十二人，就是一个做热敏传感器的小作坊）去年春节，说老板不给涨工资就不给干了。前天路过他们厂，请我吃饭时我问他老板给你工资涨了吗？他说：还跟前年一样。我：去年春节不是说不涨工资就不给他做的吗？他：涨工资不敢提了，前年年底好几家要挖我去，疫   情 期间的一年，没有一家厂挖我了！"}
{"author": "是胖莎呀！", "content": "错把洗面奶当牙膏天晓得这种味道有多酸爽[大哭]........."}
{"author": "花开二零二一", "content": "姑娘说:“新年愿望是和帅 哥 恋 爱，明年带回来给你们做年夜饭。”老婆回:“我的新年愿望是你别白日做梦。”真逗！"}
{"author": "醉酒舞剑砍疯子..…", "content": "老爸和老妈前段时间吵了一架，谁也不搭理谁，一直冷战中……昨天午饭后老爸和往常一样骑着他的小电驴又去了郊外的池塘钓鱼去了，没多久，老爸就给老妈打电话:你能让闺女来接我吗？我妈:啥事？老爸:我的电瓶车放路边不见了，肯定是被偷了，这么远的路我没法回去。我妈立马让我开车把老爸接回家。老爸像做错事的孩子一直不敢吭声，老妈不停的数落老爸 ，最后老爸道歉老妈才停下来。接着老妈转身小声对我说:去你邻居二叔家把电瓶车骑回来，是我让你二叔去偷你爸的小电驴的……"}
{"author": "胖香", "content": "那年，我还是小学生，有一天俺妈突然问我：“你知道什么是三纲五常不？”我特溜的回答：“三缸是米缸面缸水缸，五肠么……大肠！小肠！盲肠！十二指肠！噫～还差一个是啥肠？！”"}
{"author": "王飞王飞王飞", "content": "周末我带爸爸去滑冰，爸爸特别开心，开心的像个孩子，看着他的笑容，我觉得一切付出都变得有意义。"}
{"author": "夏有凉风秋望月", "content": "周末，和刚认识的男友逛街，中午的时候，男友说前面新开了一家自助火锅店，而且新店开业搞活动，比较划算！为促销活动，店家还推出抽奖活动，据说一等奖是免费试吃一个月，并且有机会成为他们店的形象大使！一听这个我心动了！要是我能成为形象大使，我还怕找不到更好的男朋友吗？但是一听价格，我又有点犹豫了！男友趁机又跟我说还有手掌那么大的海虾，和牛随便吃！我居然脑抽了，问河牛？河里养的河马吗？男友的口居然张开那么大……像极了河马！"}
{"author": "天热打鼓球", "content": "每次让老婆做饭，她必定会做炒豆芽！做饭时就开始专心致志择豆芽，一择就是一两个小时。期间还不忘吩咐我做些辅助，帮着淘个米，洗个菜，顺便炒一下……豆芽择完，我饭也做得差不多了！最后还说，今天她做饭，让我洗碗！"}
{"author": "璃白°", "content": "前段时间，儿子吵着闹着要养一只小动物，我想着要不干脆养只母鸡，还能下蛋。今天儿子放寒假了，大清早我去市场买了只母鸡，关在笼子里，放在客厅。上面写了几个字：宝贝寒假快乐--爱你的妈妈。我在厨房做早餐的时候，儿子醒了，他一把抱住鸡笼，哭着喊着：妈妈，你怎么变成母鸡了，我不要小动物了，你快变回来啊……"}
{"author": "吃了两碗又盛", "content": "现在机器人太猖獗了！昨天我接个电话，来电标记广告骚扰，但我很闲，闲得蛋疼，就想听听她说啥。声音挺好听，很柔软，说着介绍保险的话，我没吭声，她又问我有没有房有没有车，我还是没吭声，她居然还在继续说，，，我说你不会是机器人吧？电话里笑了，怎么会是机器人呢？可能是我说话太快了，，，，难道是真人？我心里想着，但我说话有时候会把最后几个字重复一遍，所以我再次说，机器人。电话里笑了，怎么会是机器人呢？可能是我说话太快了，，，，，我说机器人机器人，，，，电话里说怎么会怎么会，，，，一切都索然\n…\n查看全文"}
{"author": "上天揽九月、", "content": "洗完澡出来跟男朋友说：最近手机电池不耐用，是不是要换新电池？男友玩着手机说：没事，天冷电池有衰减，不耐用正常，注意充电就行。我点点头回屋了，似有明悟：天冷不仅电池不好用，男朋友好像也 不 听 话 了…"}
{"author": "石锅拌着饭", "content": "身为一个男孩子从小就有一种奇怪的爱好，居然觉得花圈上面的大红花好看，常常会摘下来带回家玩。而带回家的结局总是免不了一顿胖揍，然后家里就开始请一群念经跳大神的胡子大爷回来。虽然如此可这个习惯却总是累教不改，可能是爱美之心人皆有之。记得有一次大早上和老爹上街，出门时天还没亮，走着走着路过一个坟场，我一眼就看见一座新坟旁靠着的花圈。顿时就走不动路了，咬着手指看老爹走远，立马冲上去将主花摘了下来。未免发现又将主花塞进老爹背着的背篓里面，一路既兴奋又紧张的跟着老爹到集市。到集市时天\n…\n查看全文"}
{"author": "鱼歌浅唱", "content": "单位一白莲花体质的妹子调离，大家在商量要不要例行公事开个欢送会。婷婷“如果白莲花不参加，我同意！”"}
{"author": "花开二零二一", "content": "跟风，在吱咐宝输入“在吗”播一首歌，我的是《在一起》，老婆的是《你不是他》！"}
{"author": "聊天不撩妹子", "content": "年后第一天开工，业主是皮   肤  科主任。为了讨个吉利，业主不但给了我们红包，还请我们去吃饭。。饭店服务员都回家过年了，还没回来，老板娘亲自上来给我们倒水点菜。老板娘有个动作被业主发现，就是写几个字就会把手申到背上挠几下。业主可能出于职业习惯就问她有皮肤病吗？老板娘回的也算决了；先生你看菜单上有就有，没有的是真没有！笑  喷  的真的不是我一人。。"}
{"author": "璃白°", "content": "我哥和嫂子是相亲认识的，我哥领着嫂子来我家吃过几次饭，嫂子吃饭斯斯文文的，说话也是轻言细语。我哥很得意，说最喜欢这种淑女范，还常常对我横挑鼻子竖挑眼，说我这样的女汉子性格，以后怎么嫁得出去。三个月后，他们举行订婚仪式，哥很开心，嫂子更是兴高采烈，频频向大家敬酒，更是大块吃着肉。我哥在一旁看得目瞪口呆，嫂子已经有点醉意， 嘿嘿一声，对我哥说道：已经订婚了，有些事就不瞒着你啦。"}
{"author": "无书斋主", "content": "小区门口一理发店搞活动，九块九理发，并且是全套洗剪吹！……于是，我把岳父岳母舅子老婆都叫了过来，加上儿子和我……一个上午，八十块钱……下午，这老板看见我打电话，笑着笑着竟把门关了！！……"}
{"author": "偷惢前男友", "content": "村里一对新人结婚，我们一群小伙伴在村口看着新人走过去，他们一个个都说什么新娘好漂亮啊，新郎好帅啊之类的。只有一个二逼在旁边看着摇摇头叹息的说：哎，可惜了，今晚又有两个人要失去贞操了。没错，这个二逼就是我"}
{"author": "捉女妖的天师", "content": "收到大儿子的信息：爸，给我发个红包，我和同学在外面玩呢臭小子一般情况下是不会找我有要钱的，为了确定是他本人我要求他来发语音…：多少？：一百应该够了！：别让你妈知道：👌红包刚转过去，就收两条信息对方已收取红包对不起，我是卧底[臭美]"}
{"author": "璃白°", "content": "以前在一家小公司的人事部，做小文员，凡是入职的，第一关都是在我这面试，由我讲一些公司企业文化、福 利待遇等。当然，招聘的时候，肯定会把公司的待遇吹嘘一点。后来人事部部长离职，招聘了一名新部长。一个月后，新部长以我工作不认真为由，将我开除。我不解，他说，当初他来面试时，我把公司吹嘘的天花乱坠，害他入坑啦。"}
{"author": "璃白°", "content": "老公的大姐回娘家，跟我们发牢骚，说大姐夫的工资卡明明在她身上，昨天收拾衣柜的时候，竟然发现大姐夫，偷偷藏了几千块私房钱，也不知道这些钱哪里来的。老公说道：大姐你是不是傻啊？现在很多单位，工资是打到卡上，但奖金都是发现金。等大姐回家后，我一言不发、死死的盯着老公，这货面红耳赤，讪讪的从沙发下面，掏出一个黑色塑料袋。"}
{"author": "萌萌、萌萌哒", "content": "前天儿子在幼儿园被小A打了，今天放学的时候，小A摔倒了，小朋友们都过去拉小A起来，只有我儿子趁机过去踢了人家一脚..."}
{"author": "璃白°", "content": "我妈是周围村庄有名的媒婆，撮合了好多对小两口。那时，我第一次带刚谈不久的男朋友回家，我妈十分热情，一直问着男朋友家里条件、还有父母工作等等。问完后，我妈一拍大腿：小伙子条件不错啊，有女朋友没，阿姨帮你介绍一个。我在旁边急得直跺脚，我妈才想起来，尴尬的笑道：哎呀，帮人做媒做习惯了，忘了这茬。"}
{"author": "筱悦吧", "content": "我可真是个败家子，上亿的家产，我一醒就没了。"}
{"author": "才下眉头却上心头", "content": "什么叫远香近臭，老公外出打工四个月才回家，回到家以后我的地位发生了翻天覆地的变化，人家父子俩抱在一起亲亲热热的睡觉，剩我一个外姓的碍眼的孤孤单单一个人靠着床边睡，我还生什么闺女，再生了闺女，恐怕床边都没我的位置了"}
{"author": "千丝雨ベ万人迷", "content": "失恋不久的我，哭着从同事婚礼上跑出来，闺蜜心疼的陪着我安慰我要请我吃饭。走进了一个很豪华的饭店，我感激的看了一眼闺蜜，对我真好，这辈子有一个朋友足以。闺蜜要了两瓶酒，点了一大桌子菜。和我碰杯，恨恨的说:我今天随了五百块钱的份子，本来可以吃上大闸蟹，大龙虾，没想到让你这个损货给破坏了!今天我不吃你五百块钱，我就不走了!没错，今天你请客!"}
{"author": "璃白°", "content": "我结婚的时候，闺蜜把我的高跟鞋藏起来，硬 是从我老公手里，敲了四个大红包。这不她结婚了，我以牙还牙，藏起她的鞋子。万万没想到，她老公才刚敲了敲门，闺蜜就光着脚丫子，开门和老公走了。边走边小声嘟囔：结婚后，我老公的钱就是我的钱，想要我老公的红包？想都别想！！"}
{"author": "梁山伯与祝英抬杠", "content": "]昨天社区做核酸检测，我检查完出门的时候，外面进来两个老太太，其中一个老太太问门口的工作人员：“小伙子，核试验在哪儿做？”"}
{"author": "筱悦吧", "content": "饺子馆吃饭，人家店里太忙，老公说我们拿一些生的回去自己煮吧？老板说可以，不用在这做，算你们便宜点，两份收你们二十块，平常都是卖三十的！回到家发现，这特 么不就是超市卖八块钱一袋的么？！"}
{"author": "微微的倾城时光", "content": "今天闺蜜去交警队处理违章，因为分不够扣，问交警我分不够，在哪里买分呢？交警上下打量了她一眼说道：“你咋不去派出所买枪呢？”[捂脸][捂脸]"}
{"author": "薄之凉", "content": "单位放假了，我出去喝酒，老婆：除了喝酒你还有别的事吗？一个星期喝八次，你有病呀！我说：我响应号召春节留守，不回老家，没事做喝点酒怎么了？老婆：号召你们喝酒了？提前放假为了让你们居家休息，多陪陪老婆孩子，你却出去瞎混，现在不让聚集，没必要的应酬都推掉……老婆数落我半小时，我实在听不下去了：不就是喝点酒吗？你想干什么？把我逼急了，我可什么事都做得出来……老婆拿过来儿子的《5年中考3年模拟》，冷笑着说：什么都做得出来？来，你把第37页最后一道题做了！"}
{"author": "狐小乔", "content": "快过年了，想差着去买身新衣服。逛了一下午终于看上一套，试穿出来，不太理想。“亲，你把腰带抽出来，效果就好了。”店员说。“这衣服没有腰带啊。”“你肚子那鼓鼓的不是腰带卡子吗？”店员疑惑。“姐，这是我肚子上的肉！要不，你帮我抽了？！”"}
{"author": "给你新的一天", "content": "我：司机师傅，到机场要多久？xxx：蛮久的哦。我：起码要多久啊？xxx：骑马就更久。我：..."}
{"author": "保质期～", "content": "班上新来一位学生，名字叫“马騳骉”。开学点名了，班主任不知怎么念，就说 : 马叉叉到了没？ 数学老师喊：马6到了没？"}
{"author": "2丫头还是个宝宝", "content": "男人👨看美女大概就是与身俱来的一个爱好了。家有5岁男娃，小时候上幼儿园小班，老师挺漂亮，上学好积极，中班换了2个年纪大的老师，天天说不去学校，不喜欢老师，幼儿园中班一年的成绩也不好。  幼儿园大班又换了2个漂亮老师，学习又特别积极，天天说老师漂亮，又温柔，大班的成绩也提高不少。这样他以后上小学了可怎么办哟。"}
{"author": "薄之凉", "content": "合租室友提前回家过年，他给我留5项“作业”：换卧室的吸顶灯、疏通厕所下水管、修理抽油烟机、更换电视旁边的插座、修理阳台上两个纱窗。好家伙，又让我当电工，又当水暖工，我的头有点大。刚才，合租室友打电话：那些都搞好了吗？我：你就放心吧，全搞定了。合租室友：这么快就搞好了？你是怎么做到的？我：我把咱们的租房退掉了，烦恼也没了。合租室友：你是来搞笑的吗？2021春节后我回去住哪？"}
{"author": "骑着二哈啃黄瓜", "content": "闺蜜从小贫穷，长大后也是比较朴素。开车回老家看父母，本来说傍晚五六点就到我们楼下的，还兴高采烈的说给我带了特产冬笋，到7点了还没上楼，做的饭菜都凉了，也不见回来。无聊中我就逛到楼下，走到社区门口去，只见地板上摆着几个蛇皮袋，上面还有剩下几斤小冬笋，旁边立着个牌子:老家冬笋，批量促销，10元一斤，闺蜜在寒风中瑟瑟发抖。闺蜜看到我，很惊讶，弱弱的解释:这些个头比较小卖不出去的，我门留着自己吃，你不介意吧。。。我看着心疼，脱下大衣给她\n…\n查看全文"}
{"author": "闲花一剁", "content": "从前乡愁是一张小小的车票我在这头故乡在那头现在乡愁是一张小小的核酸证明我在这头故乡说“你在那头吧，别回这头”"}
{"author": "狐小乔", "content": "护士一枚。我们科前段时间住了一位老大爷。刚来住院的时候，屁.股上有一块压疮。我们每天查房的时候，都要看看恢复的情况，顺便再看看其它地方是否出现新的压疮。今天，我们又去看的时候，老大爷一脸不情愿，边掀被子边小声叨叨：“我说你们这些小姑娘，也没个小姑娘的样儿啊！天天来看我的ding，这ding有什么好看的？？？”"}
{"author": "山鹰寂寞飞", "content": "小学的时候，我经常被同学揍，十分恼火，于是幻想练出一门绝世武功，无敌于我们沙河店高级小学。春节拜年，我收到了一笔爸妈不知道的压岁钱，是我爷爷给我定的娃娃亲的那家丈母娘给的，整整三十块！我用这笔巨款，在学校重金求购武功秘籍，一同学为了赚这笔黑心钱，让他上初中的哥哥手绘了一本《辟邪剑谱》给我，薄薄的，只有十几页，说是他祖先林平之留下的手抄本。为了让我相信这是真的，那同学还带我去他家翻看了家谱，果然有个叫林平之的祖先，我当时就付了十五块，还有一半是约好练成神功再付。同学的哥哥收下钱，打\n…\n查看全文"}
{"author": "(糗名昭著)~魅儿…", "content": "我爸这一阵子失眠厉害，常常夜不能寐，我买的安眠药他吃了也没用，总是会惊醒。昨天我妈把他的三千块私房钱从床底下搜出来了，夜里我爸睡的可香了，早上八点都没醒。"}
{"author": "伤脑筋了", "content": "早上出来见一大爷卖豆腐，“豆腐，刚出锅的热豆腐”晚上回来大爷还在那卖“豆腐，冻豆腐”"}
{"author": "我是谁∽谁是我", "content": "老爷子今年八十了，因为支气管老毛病，一到冬天就咳嗽，也就形成冬天戒烟，天气暖了复吸的习惯。小辈们送年礼如果不给他买烟就不高兴，买差了也不开心，直接给钱也不行。今年因为情况特殊，小辈们早早就回家过年了，当然了年礼也就提前送来了。昨晚玩牌半夜没烟，就去老爷子房间找烟，到处翻了没找到，老爷子听到有动静就问我干嘛的，我说找香烟的。他说别找了家里没了。我问白天外甥女他们送的烟呢？他说都存小买部了，等天暖和了再去拿。我正想问他春节来人拿啥招待的，老娘从隔壁房间传出一句：还不是家贼难防！我是\n…\n查看全文"}
{"author": "狐小乔", "content": "“老婆，今天降温，特别冷，你穿上秋裤吧。”“不穿，影响我美丽的形象。”刚到公司，老公接到电话。“老公，你立刻给我送一条秋裤，我已经冻成冰雕了。”“老婆，可你为了美，从来没买过秋裤啊。”“那先拿我妈的棉裤来。”"}
{"author": "娇滴滴小猫咪", "content": "每当我准备认真学习的时候，这个世界就变得非常有趣，任何风吹草动都能吸引我"}
{"author": "九头纪", "content": "中学时，有天骑着自行车回家，正当要超过一妇女时，那女的突然扭过脸来大声对我喊道：“干吗去啊？”，我 凌 乱的看着她，想不起从哪里见过！但还是说了句：“回家啊”。话音刚落，路对面另外一个妇女吼道：“我买菜去啦~！”。我蹬。。。。"}
{"author": "义行天下7", "content": "与老婆闹矛盾！独自一人躲在房间生闷气，老半天终于想通了，一个大男人怎么能跟一个女人计较？要主动承认错误！负 荆请 罪！于是我在背部别上一个扫把，低着头来到大厅老婆跟前，还没来得及张嘴，母老虎见状猛的起身，怒目圆睁，“唰”就是给我一个耳.  光，火 辣 辣的疼，母老虎骂道：不服气是吧？还敢带着武. 器来找我了？……我……"}
{"author": "夲少姓〖劉〗", "content": "村头丢只鸡，传到村尾就丢了头牛，去年一整年没回家，村里传言我被抓了，为了辟谣元旦我回趟老家，村里又说提前释放了  [捂脸][捂脸][捂脸][捂脸][捂脸]我太难了"}
{"author": "大头梨不大", "content": "媳妇学医的外科医生～咯咯咯咯咯前两天跟媳妇吵架拌嘴了，今天丈人打电话叫回家帮忙杀猪，我以为是让我帮忙按着或是什么，谁知道是叫我媳操刀动手，我看着我媳妇戴着手套，只用一把医用手术刀利索的割开猪的喉咙放血，然后轻松的分割成若干块，每次下刀都能精准的找到骨缝，一点声音没有就把各种骨头拆分下来，我觉得我更爱我媳妇了，以后绝对不会跟她吵架了"}
{"author": "『空欢喜』", "content": "老公是外地的，婚后一直住娘家。后来我们因为一些矛盾离婚了。离婚后，孩子跟我一起生活。过去几年了，我们也都没有再找过对象。说实话心里是想跟他复婚。现在快过年了，他跟我说要回来看看孩子，我激动了好久，都不知道该给他准备客房还是跟孩子一起睡，我还觉得他会来我房里睡，并给他留了门，结果他没有进来。半夜三更我过去儿子房间看，他竟然抱着俩孩子睡的死沉死沉的…看来我又自作多情了……"}
{"author": "正版煮茶", "content": "那年，我堂弟报考一个大学，分数够了，得知还要体检，那年身高要求特别严格，他身高还差两公分。他很难过，体检前一天晚上灌了一瓶二锅头借酒浇愁，喝完踉踉跄跄走在街上，一头撞墙根上。第二天，他体检通过了，头顶肿起的包，把身高测量尺顶的老高..."}
{"author": "程念念念", "content": "小侄子上一年级，老师要求每天睡前阅读，再拍个短视频发群里。他们班有一个同学刚开始每天都坐在钢琴旁边阅读，这两天天冷了，开始坐在床上阅读了，每次他阅读的时候，床上不是放个LV的包包，就是放个宝马的车钥匙。"}
{"author": "十里柔情一帘幽梦", "content": "情人节晚上，我正准备睡觉，老公拿出一瓶红酒神秘兮兮的进屋：今天情人节，我们开瓶红酒吧？我满心狐疑：这货怎么突然开窍了！居然知道浪漫？难不成他在外有什么情况……我正在脑海中逐个排查他微信中的异性好友，他又拿出一次性纸杯和一包小鱼干，说：红酒杯用完还要洗，用这个省事，我还准备了小鱼干给你当下酒菜……我长出一口气：还是这货，没变！"}
{"author": "开膛手~杰克", "content": "如果一个男人可以大半夜跑到你家楼下唱歌给你听，可以在公共场合满足你所有无理的要求，可以在你不开心的时候拌小丑逗你开心，可以时不时的拿出手机看看担心错过你的信息或电话，可以为了请你吃一顿大餐而省吃俭用连续吃一个星期泡面，手机二十四小时开机任你随叫随到。那么可以肯定，这男的一定是个备胎"}
{"author": "红尘一笑醉红颜～", "content": "老公晚上喝醉了，回来就嚷着饿，让我给他煮两个鸡蛋吃，我把鸡蛋煮好放床头柜上就洗澡去了，等我洗好出来他一边剥鸡蛋一边嚷嚷：老婆，你买的什么鸡蛋啊，皮都剥不下来.....我过来一看，这货拿着我化完妆放着镜子前的美妆蛋正在剥皮……"}
{"author": "狐小乔", "content": "旅居他国的邻居回来了，给她上初二的儿子开始进行家教补习。老师进行了小测试。“你好，xx家长，您儿子数学考10分，初中知识一点不会，我教不了。”“10分？我孩子成绩挺好啊……”“可能是我们这边知识太难了，所以只能考10分……”"}
{"author": "骑着二哈啃黄瓜", "content": "我们公司的老板是一对老夫老妻，我的直接上司是女老板，然后男老板是负责销售这边。但男老板不善于文案和统计，业务扩大后需要招了一个秘书和一个特助协助他工作。人事部特定找了二十来个面试，最终确定八个能力达标的，推荐给两位老板接着面试。推荐刚发，人事部老大就接到女老板电话:那两个a和b(漂亮的)履历不匹配，就不要邀请过来面试了，别浪费别人时间和精力，没必要。人事部老大对着女老板点头哈腰，刚挂完电话，男老板来电话了:那两个a和b能力结\n…\n查看全文"}
{"author": "骑着二哈啃黄瓜", "content": "陪父母逛街，父亲在一家店面前被特价轻羽绒服吸引住了，款式还相当不错。。。店员看到父亲驻足，就热情介绍说:这是去年的款式，今年上新款了，这些就促销了，80一件相当划的来，去年是卖四百多的。还指着挂件里的鸭绒说:真羽绒哦，假的罚十。父亲二话不说试了几款，挑选了两件，试完衣服舍不得脱就穿着陪我们逛街。好不容易逛完回家，在社区父亲碰倒老同事，同事看见父亲穿新衣裳，同事热情打招呼:老*，换新衣裳啦，还挺好看的嘛。父亲眉开眼笑:见笑见笑，逛街\n…\n查看全文"}
{"author": "璃白°", "content": "元旦假期，带儿子回娘家小住了两天。晚上儿子回房睡了。我在客厅嗑瓜子，我妈走过来就是一个暴击：嗑瓜子轻点声，别吵到我外孙睡觉。第二天中午，我午睡，儿子在客厅嗑瓜子，我不满道：嗑瓜子轻点声，别吵到我睡觉。我妈走进卧室，又是一个暴击：我外孙嗑个瓜子，你也要管啊？我……[大哭][大哭]"}
{"author": "《龙妹妹》", "content": "我姓龙又属龙九五年古天乐版新神雕侠侣红遍大江南北后，同学和小伙伴们就一直叫我小龙女！后来找工作的时候我习惯性的在入职表上写的  小龙女  发现写错之后又重新写了一张，还跟他们解释为什么写错！他们开玩笑的说你以后就叫李若彤吧！直到前段时间公司开年终大会，领导在台上叫我名字。我心里还在想；这是谁呀？那么大架子，领导点名都不回应的！坐我旁边的同事推了推我小声的说道；李若彤    领导再叫你呢！"}
{"author": "156.", "content": "爷爷年纪大了耳聋，经常要大喊才能听见。我今天领着他去配助听器，试戴各种型号时，为测试效果，医生每次都会小声问: “大爷，听得见吗？”爷爷都生气地回答说:“听不见，一律听不见。”医生一脸苦笑，又贴着耳朵问了好几遍，最后没办法了，见我在边上憋笑，于是问我怎么回事，我说:“他眼神还好，看得清价目表，你给我打个折，他应该就能听见了”"}
{"author": "吾乃敞衫罩子隆", "content": "我和朋友在酒吧喝酒，他喝得太多，酒精中毒了，我赶紧叫了个车带他去医院。路上给医院打电话，让他们准备好担架。司机开的飞快，刚一到医院，我立马从车上下来，开始吐。医生和护士赶忙让我躺担架上，我说：“需要担架的人在车上，我是晕车。”"}
{"author": "忧郁的创可贴", "content": "从小在姥姥家长大，长得也比较瘦小，经常受欺负。好在，邻居家有个青梅竹马的弟弟，一直保护我长大。后来分别读了两个不同的大学，没能再续前缘，一直比较遗憾。后来大家都大学毕业了，春节时拜年，又遇到了，得知双方都是单身，于是坐下投机的聊了起来。。。期间他提出要给我看手相，自谦的说学中医看的很准，我也抱着试试看的想法，把手递给了他。然后他就滔滔不绝的说了起来：你看这个部位有点发青，是肾～ 虚，然后你看这里，这是便秘的体现，还有这里，是很严重的胃病。。。\n…\n查看全文"}
{"author": "、萍萍玉立～～", "content": "我在吃火锅，陌生的他坐在了我的对面。他主动开口，自来熟的语气就像是我二姑家养的那只老狗。我皱着眉头，正好手机响了起来，是老妈来电：你不相亲，只好出此下策。恍然大悟，这是赶着饭点来给我介绍对象的！他刚想开口，我夹起一块八分熟的牛肉塞进他的嘴里，说道：吃完，各走各的！他伸手招来服务生，再上了一桌菜。就这样从晚上六点，直到凌晨两点，服务生一直守着我们，打着瞌睡………"}
{"author": "骑着二哈啃黄瓜", "content": "快去上班了，整理下行李。。。小侄儿在一旁泪眼婆娑:姑姑你啥时候才会回来啊，才不到10天你又要走了，我舍不得你，天妒英才啊。。。我挺感动的，这个又菜又爱表达自己情绪的侄儿总是那么粗暴简单。于是安抚了他情绪，抱抱他，趁着空儿，交代嫂子:明天我出发的时候得背着侄儿，省的倒时候他哭哭啼啼甩不开，到时候嫂子你得支开他。嫂子盈盈一笑:你的担心多余了，你这个侄儿势利的很，要不是你每次回来都给他买这买那还时不时给他那么多零花钱，他\n…\n查看全文"}
{"author": "中国加油！！", "content": "小时候老被人占便宜还不知道...村里有一个吊毛欺我年幼无知，有一次神神秘秘地对我说叫我千万别叫他爹，我当然要问为什么？他说他肚子会痛，然后我就突然叫了他一声，于是他马上就捂着肚子做痛苦状，后来我为了让他肚子一直痛就满街追着他叫，直到被我亲爹一脚踹到地上..."}
{"author": "梦若流水", "content": "男同事找我闲聊，说谈了个女朋友，长得有点丑，他家里死活不同意。我对这种事情不太懂，只能当个听众，他边聊边拍了我一张照片，我不知道他为什么拍我，但也没多想，后来他回到自已座位上了。过了一会儿，他手机里响起一个大妈的语音：“算了算了，你还是跟原来那个交往吧。"}
{"author": "老毛的酒", "content": "小舅子和刚认识没几天的护士女友分手了。我：老弟，为啥分手啊[疑问]那姑娘挺漂亮，家境也很好，差啥呀[疑问]。小舅子：她哪方面都不错，就是有一个习惯我受不了[哀怨]我：你还挑人家？你坏习惯也不少[挖鼻孔]，她究竟啥习惯你受不了啊[疑问]小舅子：她无论拿起什么，都喜欢先弹一下[捂脸]"}
{"author": "。。。.h", "content": "这疫情就像酒局，本来就要散了，湖北都去结完账了，东北也撂筷子了，结果北京又咣当开了一瓶，还特么顺手给天津满上一杯，还没喝完，新疆人又要了100个烤羊肉串，顺便给浙江点了个外卖，结果大连又要了份海鲜，顺便给福州夹了一只虾好容易大家都吃饱喝足准备去k歌了，河北突然推门进来:不好意思各位来晚了，大家都满上啊，我先自罚三杯，我去，又特么开始了[捂脸][捂脸]"}
{"author": "小恩的老公8", "content": "单位领导每次在朋友圈发了“媳妇不让抽烟了，身体也越来越差，准备把烟戒了……”，第二天他的办公室总会多出几条香烟……我就奇怪，是谁想要害领导？据我多次观察，都是那些和领导关系好的同事送的。我把这发现和领导说了，领导脸一沉，说会严肃处理这一些害群之马！第二天，领导说单位门卫缺人，让我过去，说门卫是单位的安全保障，责任重大，以后就交给我了……"}
{"author": "坏小孩cium", "content": "长得美是一种什么体验…       幼儿园来了一个家长带孩子来参观幼儿园，看教室很满意，看厨房很满意，看室外活动场地很满意，更加满意和蔼可亲的老师们，决定明天送孩子入园。        这时候我从办公室出来了，老师们介绍，这是我们园长。家长瞬间变了脸，园长这么好看，不安全，算了，换一家。拉着孩子就走了。。。"}
{"author": "狐小乔", "content": "与一位家庭优渥的孩子妈妈聊到孩子的学习。“我有点焦虑，担心孩子以后学习压力大，性格变得不开朗怎么办？但是不好好学习，又担心她将来出苦力过得不好怎么办？”我如实地说出我的想法。“根本不需要，学习不好可以从商或者做技术，家里只要给准备好启动资金，孩子还是会生活的很好。”我是不是该安静地走开？"}
{"author": "绝版≌帝君", "content": "今天微信突然有一个女的添加好友的请求，看名字不认识我以为又是微商什么的也没在意，一上午加了八个好友我点了一下，这时发来一个一千块钱的转账，我还以为是骗子呢，就问你是谁啊她说兄弟我是某某啊，七年前我借你一千块钱现在有钱了还给你，我感觉有点不敢相信，像是捡到了十万块钱一样，当年我走投无路的时候跟他说了一下能不能帮我一下把钱还我让我顶几天，结果等来的就是不就他妈逼的借你一千块钱吗还尼玛打电话来要，从此把我拉黑了，我都没想到这钱还能回来！"}
{"author": "天热打鼓球", "content": "刚来南方，一直想学粤语。自己还认真的偷偷的练习了好久。有次看到同事们聊天，鼓足勇气用粤语插了几句？当时空气都安静了。有个同事为缓和气氛还夸我呢：你的家乡话跟我们的粤语好像耶！"}
{"author": "芭蕉窗下听雨声", "content": "昨天陪闺蜜去医院取环。又是彩超，又是宫腔镜.....医生说子宫有息肉，要动手术。取完环，她看着帮她跑前跑后的我。感动的拉着我的手说：过几天我来动手术，你也查查。咱一块动手术好么？[笑哭][笑哭]"}
{"author": "空城旧梦她与伞", "content": "结婚纪念日，媳妇准备了烛光晚餐，还配了一瓶红酒。吃到一半时，媳妇深情举着酒杯：这些年我们不容易啊，记得谈恋爱时，父母反对我远嫁，有一次你又数落了我两句，等你上班后，我收拾好行李准备离开你，恰好那时候对面手机店的音响放了一首歌，听到那首歌，我想起了我们的点点滴滴 ，我哭着又把行李放回去。我也端起酒杯：哦哦，媳妇啊，那是首什么歌啊，好听吗?现在，媳妇已经三天没理我啦。"}
{"author": "苍南下山耍流氓，黑…", "content": "出去吃饭带回来一根大骨头，扔给我家狗狗让它磨牙。早上我拿起那根骨头一看，只见上面齿痕累累，竟然有一头还被它咬碎了。我呆呆的拿着骨头想着它咬合力到底多大时。女朋友走过来一脸嫌弃的说：你是不是想吃里面的骨髓，，？"}
{"author": "『空欢喜』", "content": "五年前，我嫌弃男友懦弱不果断，分手了。现在还单着，前两天收到老家发小​的电话，说要结婚了回来喝喜酒，还说老公不错，开了几家店。我问她:老公哪里人？她开心的说:他叫某某某，本来性格懦弱，后面听说​被有钱人家女儿抛弃，后面发愤图强，几年时间就发展起来了，他喜欢我的平常心。某某​某，这不是我前男友么？这这这。。。我尴尬的解释说:很不巧啊，你结婚那天，刚好公司有个销售展会去不了啊，下次吧下次吧。。。"}
{"author": "薄之凉", "content": "单位一东北女孩失恋了，我好心问她为啥，她说：男朋友看不上我，他说我太丑了。我劝她：不能一棵树吊死，好男孩有很多，他说的话也不对，你看你丑啥？没等我说完，她马上接着说：瞅你咋地？我想她是误会了，便解释：我是说你丑啥？是丑……她急了，打断我的话：瞅你咋地！上来一个大耳光，下面踹了三脚……"}
{"author": "『空欢喜』", "content": "元旦放假三天，在家无聊就躺在床看鬼片，晚上迷迷糊糊睡着了。突然一阵敲门声把我惊醒，第一次听见以为是做梦，就没有理他；接着又敲几下，还是没有听见谁说话；却听见几声猫叫，拿手机一看已经凌晨四点，着实恐怖，又害怕       结果听到打电话的声音，兄弟你不是住606吗？怎么不开门？我在你房门口        住隔壁的是一个工厂上班的，我就发信息给他：我看了一整天的鬼片，吓得我好不容易睡着又被你们惊醒，你们大半夜的想干嘛啊？结果他回信息说：看了一天的鬼片不敢一个人睡，叫了一个人来陪\n…\n查看全文"}
{"author": "银行门口的雪人", "content": "本人在我们群里素有冷场王之称。为了避免尴尬，我又偷偷建了一个小号，拉入了我们群中。每次我在群里说话半天没有人回应时，我就会上小号，用小号对大号发表的言论进行肉麻的阿谀奉承，我正为自己的高招感到沾沾自喜时，却发现群里的人被我两个号刺激的都纷纷退群了，现在群里就剩了我的大小号了！"}
{"author": "夏有凉风秋望月", "content": "前天闺蜜结婚，我去当伴娘。到男方家后，他们挺豪气的，婚宴用的茅台招待宾客。由于怕被伴郎等灌酒，就叫姐妹们先弄两瓶换成凉白开备用。宴席上，男方宾客看我们伴娘个个花枝招展的，都想过来敬酒。果然这时一个男的端着一杯酒，带领着伴郎团过来要敬酒。我说敬酒可以，用杯子喝不痛快，吹瓶吧。说完，拿起准备好的茅台，先干为敬。喝完一抹嘴，拿着空瓶倒口，一滴不剩。面不改色的拿起另外一瓶放旁边。大喝一声，谁要来敬酒，先把这瓶茅台干完再来。我在陪你饮上三大碗。当即就没有一个敢说话的都吓跑\n…\n查看全文"}
{"author": "狐小乔", "content": "闺蜜生完小孩给妈妈打电话。“妈，孩子缠颈，提前剖了，女孩，5斤半。”“啊，你自己千万别着急上火，我马上买飞机票过去。”“嗯，就是担心孩子，在保温箱，我们见不到。”“放心吧，在医院医生护士比咱们会照顾，你就把自己照顾好就行。”闺蜜给婆婆打电话。“妈，孩子缠颈，提前剖了，女孩，5斤半。”“啊，那我孙女可招罪了，现在她情况怎么样？”“在保温箱呢，我们见不到。”“哎，我孙女命苦啊。我把家里事情安排好以后再过去看你们，让你妈先过去照顾你吧。”"}
{"author": "兰花沟一霸", "content": "我六岁四个月的宝贝女儿和我说，等她长大结婚，她会和她的老公撒娇，过得很幸福。我很好奇问“你怎么撒娇呢？”她把毛绒绒的小脑袋往我怀里一塞，柔柔的说“老公，我想吃哈根达斯……！”我……！这不就是昨天的我吗？！原地爆炸！"}
{"author": "唐僧熟了", "content": "拥挤的地铁上，混乱中用手摸了一下前面妹子的大腿。旁边一位小伙充满正义感的指责我是个流氓。“就特么你事多？”姑娘对着小伙说"}
{"author": "忧郁的创可贴", "content": "公司这两天搞急救演习，一直给我们在线普及急救知识。还说以后要不定时抽查。今天下午李经理忽然一副腹痛的样子捂着肚子， 这就开始演习了？我生怕考核不合格，关心的围过去抓住他，他嘴里念叨着 : 上。。。我：上？上担架是吧？赶紧拿担架！他艰难的继续说：测。。。我：测体温？马上安排！他面露苦涩：所。。。我欢快的说：所以我考核通过了？李经理拍着桌子说:通过个屁，我只是要上个厕所，你别拉着我\n…\n查看全文"}
{"author": "李辉a", "content": "表哥女友第一次跟他回家见家长，玩了两天说要回家看一下父母，她走后。表哥问父母的印象如何。舅舅开口了：“这女孩长相平平，个有点矮还有点胖，你怎么也喜欢这种类型的女孩？”表哥还没说话，舅妈大声的呵斥道：“你刚才说什么，你给我解释一下‘也’是什么意思？”"}
{"author": "梦爹爹", "content": "一妹子今天跟我说她失业了。我问：“为什么辞退你？”妹子回答：“他们嫌我胖。”我为妹子打抱不平：“这是歧视，你可以告他们，你在哪儿上班，干什么工作？”妹子：“我是按摩店踩背的。”"}
{"author": "净心居士", "content": "胖丫把自己打扮的从来没有漂亮，说要和闺蜜逛街去。我想她闺蜜又不是不认识，又吃饭又可以AAB了。谁知道她说道:闺蜜嫌弃你总是过来蹭饭，我闺蜜都对你反感了，所以今天我们约会你就不能去。在家无聊的我看了最近某音上很火很感人的真人改编的电影《天堂的张望》把我感动了鼻涕一把，眼泪一把，餐巾纸扔了满满一纸篓。。。。。。晚上胖丫红光满面的到家，看着废纸篓，直接一个旋风腿，我就像足球射门一样飞到阳台。只听她厉声的说道:今天在家你又做了什么见不得人\n…\n查看全文"}
{"author": "石锅拌着饭", "content": "本人痔疮一直很严重，长期以来把我折磨的苦不堪言，各种老中医偏方都试遍依然不见好转。过年回家被发小约出门喝酒，席间几杯酒下肚忽然想起他也有痔疮，就问他现在可有好转？发小面皮抖了抖，然后面带微笑的说，“好了。”我大惊，望着他跟遇见亲爹，一把拉住他手请教良方。发小震惊的看我拉住他的手，一把挣脱，“兄弟我俩说事归说事，别乱牵手。”玩归玩，闹归闹，别拿牵手开玩笑。说完发小掏出一支烟点上，目光忧郁的望着远方，“那是我去重庆工地上班的第二年夏天，都知道重庆号称火城，工地上什么东西都晒的\n…\n查看全文"}
{"author": "狐小乔", "content": "去饭店吃饭，邻桌一姑娘要了一碗米饭一个粉蒸肉。吃完后擦了擦嘴猛喊老板。老板过来了，姑娘说:“没钱！”老板笑了笑回道:“没钱就走吧？哪来那么多费话？”姑娘不好意思的说:“要不我亲上您一口顶饭钱吧？”老板白了姑娘一眼转身正欲离开。边上一位六十多岁的大爷站了起来笑着对老板说:“小姑娘吃饭没钱，想亲你一口顶帐，你又不敢。要不这样？你让姑娘亲我一口，这饭钱我替她付了。你看行不行？”老板发怒的看着身边的大爷高声说道:“你给我一边呆着去，她是我外甥女！”这时一位五十多岁的大嫂也走了过来:“\n…\n查看全文"}
{"author": "萌萌、萌萌哒", "content": "儿子：妈妈，我出生之前在你肚子里么？我：对儿子：在你肚子里之前呢？我想了半天：你原来是天上的一颗小星星，在天上选爸爸妈妈，选好了之后就跑到妈妈肚子里了。儿子半天没说话，我问他怎么了儿子：那我选的可太差了！我..."}
{"author": "昵称太过于个性，系…", "content": "老婆睡觉喜欢蒙头睡，而我晚上睡觉总被老婆打醒，每次的理由都是我放屁把她给臭醒了！唉，我的肠胃可能不好，但是我白天也没那么多屁呀。唉，算了，挨打就挨打吧，影响她睡觉挺不好意思的。直到有一晚我睡不着，便在熬夜玩电脑游戏，忽听在熟睡的老婆“bu，bu，bu……”放了几个连环屁………大概10秒后………这娘们儿猛的掀开被子，抬手就要往我这边锤，发现我在玩游戏愣了一下，然后一个鲤鱼打挺就窜起来给了我一脚！！！PS：我怎么觉得每次都是她自己把自己熏醒然后来揍我[不高兴]"}
{"author": "吃了两碗又盛", "content": "除夕。一早上媳妇和儿子里里外外都换上了新衣服，而我穿完一双新袜子之后就没什么可穿的了。"}
{"author": "上天揽九月、", "content": "男友本命年，想送给他一件礼物保平安，不确定本命年送什么好，就在‘姐妹’群里询问大家的建议。有人说送红袜子，有人说送转运珠，，，经过姐妹们激烈讨论，最终达成共识：让我选择分手，说我配不上人家！！我…大意了…"}
{"author": "图图的耳朵会动耶", "content": "表姐买了个长纱裙，可仙了，我看得两眼放光！表姐看我喜欢，就说送给我，我忙推辞，表姐把裙子往我怀里一塞：你跟我客气啥！我就试穿了一次，有点短，不咋喜欢，你喜欢就拿走！我欣喜若狂，忙拿起来对着镜子比划，表姐笑着说：很好很好，你当抹胸裙穿刚刚好！"}
{"author": "南九", "content": "昨天去理发，人特别多，等了快一个小时，我前面还有三个人。咯咯咯……正心烦玩手机，突然进理发店一个小伙子，对理发师说:二舅，啥时候给我理发？理发师一愣，指着等待的一群人说:没看见这么多人都在排队么……小伙子一撇嘴:那我不理了，过完年再说吧！转身刚要走，理发师两大步跑过去，抓住小伙子肩膀，用推子在他脑袋上狠狠推了一道沟，说:这回不用走了，坐那等着吧……"}
{"author": "坏小孩cium", "content": "早上起床，看见餐桌上有包子、粥，牛奶，煎鸡蛋，看着胖哥在厨房里忙碌的身影，满满的幸福感油然而生，要不是妞妞一巴掌拍醒了我，叫我起床做饭，我准备先吃个包子........"}
{"author": "狐地瓜大人", "content": "在食堂打好饭准备开动，同事妹子跑过来，挖了一勺辣椒酱给我，说是自己做的让我尝尝。尝了一下味道虽然一般，但还是夸赞：“真好吃，你手艺真巧。”  妹子笑着从包里拿出一瓶辣椒酱：“喜欢就买一瓶。”自己夸赞的，含着泪也要买，好在东西不贵…大概一周左右，妹子在食堂等我，见到我就从包里拿出一瓶辣椒酱：“你的辣椒酱吃完了吧，我给你预备着呢！！”"}
{"author": "无书斋主", "content": "今天太阳不错，照着身上暖洋洋的，我穿着大棉袄款的睡衣，在阳台上喝着热茶竟然睡着了！……迷迷糊糊中，脸上一阵冰凉！睁开眼，一岁多的儿子在我面前笑哈哈的:爸爸，水水，喝水水……我……就这样看着他往我脸上倒水，不能躲也不能叫，因为躲了，他站在小凳子会摔……叫了，吓着他了也会摔……憋屈……"}
{"author": "保质期～", "content": "我和闺女在楼下等媳妇，半天不下来。闺女：“老爸，想快点不，手机给我”我把手机递过去给闺女。闺女打电话就喊：“老妈，你老公和一个妹子在聊天，都不管我……”"}
{"author": "忧郁的创可贴", "content": "老板知道我平时不开车，驾照一直闲置，提出向我借驾照处理w z ，我当时脑子一抽，说道 : 拿去，友情价每分二百。老板的脸抽搐了一下，诚恳的说 : 还是一分三百比较稳妥。。。"}
{"author": "我是谁∽谁是我", "content": "常规体检，体检医生是我中学同学。。她对我说：马x你身体这么好，我发现我们好多同学身体都是亚健康。我：怎么同学们都是你给体检的？？她：对呀。上学那会就你三天两头病假，全班男同学都是我备选对相，就你不是。我。。。。。"}
{"author": "狐小乔", "content": "车站等车正无聊的刷着手机，过来一个大妈拍了拍我肩膀：“孩子，你听过真主吗？”我一愣，没吭声。大妈又问，孩子你听过真主吗？我：阿姨您听过安利吗？大妈：安利是什么？我：没事您继续说。大妈：孩子，2021年是世界末日你知道吗？知道信真主才能超脱自我升天。我：升天？那信了不还是死了吗？大妈愣了一下：可是不信真主的人都会被毒蛇环绕的！我：没事我是广东人。大妈：你这孩子！真主是无所不能的！你还敢吃蛇？我：真的无所不能吗？大妈：是的，你有什么烦恼，真主可以帮你解决。我：有有有，现在葱\n…\n查看全文"}
{"author": "歌歌哒f", "content": "大年二十九的时候我们还在上班，期间帮了一个女同事的忙，她一个劲的和我说谢谢，于是我便和她开玩笑道：不用这么客气，如果你真觉得过意不去的话可以来点实际的……她想了想道：要不你大年初一来我家吧……当我不知道如何回答时她接着说道：可以吃点我们三十的剩菜剩饭……"}
{"author": "净心居士", "content": "晚上吃饭时，胖丫夸我越来越聪明，都套路不到我了。我自豪的说:还不是被逼的。谁知道我老妈一拍桌子说道:那你还不出点学费，不然晚饭就别吃了。我。。。。。。"}
{"author": "中国加油！！", "content": "借着“开放二孩”的春风，在坚持不懈的努力下，我成功怀上。怕儿子一时接受不了，老公派我去探探口风。我：“儿砸，告诉你一个好消息。”儿子：“快说，快说！”我：“你将要多个弟弟。”儿子看了看四周，表情凝重的凑到我耳边小声说：“这事爸爸知道吗？”"}
{"author": "『空欢喜』", "content": "本人学医的毕业了就在婚前检查体检工作，大学交了三年男朋友由于某种原因分手了。今天他带着他未婚妻来体检办理结婚证，经过我的化验，我拿着他的化验单对着他说:那有件事，我要跟你坦白下第一项，不举也是真的。第二项，金子存活率过低，还是真的。第三项，太小，是真的。毕竟我给了那么多人男人婚前做体检，你是我见过最小的。他看着我的脸泪如雨下，问我有什么可以解决办法？我对着他摇摇头说，无得救了？他当时就跟未婚妻说不结婚了，不能害了她。他们走后我偷偷的笑了，让你嚯嚯我，该，吓死你个混\n…\n查看全文"}
{"author": "孤心傲月", "content": "老婆问我，她跟女儿同时掉进水里我先救谁？我当然先救女儿了！小孩子又不会游泳。老婆上来就是一耳光！大声骂我：渣男？有了小情人忘了老情人！！！我……TM ......……"}
{"author": "璃白°", "content": "大清早在公交站台等车，一个长得挺帅的小伙子，突然就抱了我一下。我吓了一跳，正想叫抓流氓，小伙子发话了：我不是流氓，我已经注意你很久了，你很漂亮，长得很像我的初恋，我忍不住抱一下，你放心，这是最后一次。说完他转身落寞的走了，公交车来了，我上了车，还是一脸懵 逼。突然想着这件事，得发个糗事啊，一掏口袋，卧槽，我手机呢 ？? ?"}
{"author": "夏有凉风秋望月", "content": "结婚第三天回门，我和老公带了好多东西回去！老爸老妈亲自下厨，张罗了一桌好饭。席间，老爸和老公对饮，然后都醉了！我和老妈把老爸架回房间，老公也晃晃荡荡的走了出去，还跟我说，回去吧！不用送了！我赶紧过去扶着老公，谁知他一把推倒我说，你谁啊？这么丑，也来碰我！我有洁癖！从那以后，我又在我妈家住了下来，直到现在！"}
{"author": "正版煮茶", "content": "这事老丈让说了。老家滴水成冰那天，老丈不知从哪看的说冬泳延年益寿，让我带他下河冬泳。老丈游没几米，脚抽筋扑腾着不知喝了多少冰水。我好不容易把他拉上岸，他鼓着肚子冻的嘴唇发紫，直哆嗦。我把我随身带的保暖瓶里滚热的姜茶给他喝，他喝了缓过劲来，想起刚刚的狼狈样，哈哈大笑，然后一遇冷，刚镶的牙又炸了..."}
{"author": "无书斋主", "content": "昨天几个朋友小聚，向来酒量一般的小蔡十分豪爽，左一杯右一杯的敬酒，一圈下来喝了六大杯……第二圈，看他晕乎乎的样子，刚没举杯说戒酒的我，端起他的酒对另外几个哥们说:你们别灌小蔡，他酒量和我差不多，大家喝个开心，不拼酒！这杯我代他喝了……喝完我要吐，赶忙上卫生间……回来，小蔡还在一杯又一杯的和他们拼！老张看着我:正哥，不准再代了，再代就一人代一杯……我……如果不是小蔡赶紧起来给我倒杯茶，我真想告诉他们:我刚喝的是水，凉开水！！……"}
{"author": "薄之凉", "content": "第一次去女朋友家过年，我买了很多老年人的礼品，准备给丈母娘留个好印象。一进屋，我忙讨好地对未来的丈母娘说：伯母，这是补钙的、降血脂的、降血糖的……您这么大岁数了，很容易得“三高”，血管堵哪都不行……女朋友的母亲冷笑着说：你倒想得很周全，为什么不买“速效救心丸”呢？艾玛，这我倒是没想到，现买还来得及吗？"}
{"author": "骑着二哈啃黄瓜", "content": "好朋友很开森在群里说:hot  cat终于开始带货直播了，并发了链接过来。。。有如此势头那得捧场，赶紧点进去，​某金 形  体 金老师带着学 员在整体表演塑型效果，一帮子婀娜多姿的腌制的新鲜辣白菜，翩翩起舞。。。养眼的看半天​也没看见卖啥货？公屏暴躁:货呢？二货朋友回复:那几个杵着表演的老师不是？？？？然后一瞬间我两全给闪踹出直播间。。。​"}
{"author": "程念念念", "content": "昨晚下暴雨，天空霹啦一声巨响吓的我筷子掉到了地上，媳妇吓得往我怀里钻：老公，我怕！我抱着媳妇说：打雷怕啥？这么大人了，你看咱儿子那么小都不怕。一转身，卧槽，我儿子呢？一瞅床下，看到儿子紧紧的搂着我家二哈。"}
{"author": "保质期～", "content": "最出丑的一次，刚面试完要出去。被会议室的桌脚卡了一下，一下子跪在面试者面前。面面试者语无伦次的说：“别，别，别这样。”我顿时坐那了。"}
{"author": "南九", "content": "几天没上班，桌子上都是灰尘。咯咯咯………我拿着抹布把所有桌子从头擦了一遍，娟姐接过抹布说:老九，你去洗洗手吧，我把抹布叠起来。这时候，老赵进来了，伸出大拇指对娟姐说:要说勤快，还得说娟子！娟姐急忙解释:桌子都是老九擦的，我帮他叠一下抹布。老赵接着说:看见没有！又勤劳又谦虚！有了成绩往外推！做好事不留名！我呸……这马屁拍的......"}
{"author": "歌歌哒f", "content": "今天听说我爸选上了村长，我很是为他高兴，于是做了核酸检测，并打电话告诉他，我回家的票已经买好了，预计明天中午能到家，电话那头的老爸沉默了好一会道：你还是别回了，我就当没有你这个儿子……"}
{"author": "吃了两碗又盛", "content": "先是儿子问我见没见过天牛（昆虫，属于节肢动物)，我说见过，并描述了一下特征，最后说天牛的触角一节一节的。儿子说节肢动物就那样，然后他突然问我:人身体也有分节，怎么没有节肢呢？我不知道这个问题该怎么回答，但我媳妇在一旁抢着说:人也有节肢的，你舅爷大雪天把脚冻坏了，治不好就截肢了。"}
{"author": "净心居士", "content": "这几天老家突然降温冻坏了很多水管，停水了。昨天，不知什么原因又停电了……取暖设备是不能用了，只好在阳台里隔着玻璃晒太阳。于是我到楼下的超市买了点五香豆，给胖丫当零食！就等着胖丫时不时的来个屁！我好暖暖手[嘿嘿][嘿嘿]！！"}
{"author": "义行天下7", "content": "同事小张与人闹矛盾，气呼呼的拉老长个脸，发狠话说要 想 方设 法报 复……我劝小张：兄弟！狗 咬了你 你不能去咬 狗！不成 想小张激动的一下子爆发了，猛的站起来吼道：这些都是安慰 弱者的话，我不仅要 咬 回去，我还要打 爆 他的 狗 ​​​​头！卧槽，特么你拍我的头干嘛？？？"}
{"author": "夲少姓〖劉〗", "content": "想当年在杭州厂子里打工的时候，那时候住的是厂子安排的6人宿舍，由于我是新人都说新人好被欺负，于是我想了一个办法，第一天就把宿舍打扫干干净净，早上7:00准时起床唱国歌。他们问我怎么回事，我说：“刚出来，习惯了”[嘿嘿][嘿嘿][嘿嘿][嘿嘿]那是我打工最快乐的三年[嘿嘿]"}
{"author": "向昨天说再见。", "content": "逗比朋友去打点滴，要4个小时。她不想等，于是突发奇想问医生，能不能两只手一起打？医生看着她愣了半天，然后骂骂咧咧地走开了"}
{"author": "孤心傲月", "content": "出门打拼快十年了，今年回家过年。刚进村发现村里人见了我就跑，给烟给红包都不要！祭祖的时候我赫然发现祠堂里供奉的一个牌位跟我同名………………"}
{"author": "奶爸笔记本", "content": "老师要求学生每星期写日记。之后，我每偷看到儿子日记都提心吊胆的。。。就这星期，儿子把每晚小酌一杯暖暖身子的我写成酗酒成性的爸爸；上星期把陪读的我写成暴躁爸爸；再上星期还敢把偶尔打牌的，我媳妇，写成不离赌桌的妈妈。。。最提心吊胆的是老师好像全信了，都给了“优”！"}
{"author": "璃白°", "content": "那年我十三岁，才读初中三年级，三叔家建猪圈，我去帮忙。我在下面抛砖，三叔在墙上接，我每抛一块砖，三叔都鼓励我：不错，我侄女小小年纪力气那么大，以后肯定能嫁个好人家。听到三叔的夸奖，我心里高兴，越发用力，越发抛的快 。终于，一块砖头，结结实实的，把三叔从墙上砸下来[捂脸][捂脸]"}
{"author": "红尘一笑醉红颜～", "content": "人不舒服挂了几天水，就第一天陪我去了一趟这几天都我自己去，今天我挂上水了他给我打电话问我在哪个医院，说他要过来，我还在想今天太阳打哪边出来了，结果人家是来开药的，胃不舒服……"}
{"author": "红豆红黄豆滚", "content": "记得结婚前第一次去女友家特别紧张，一大家子人都在，叔叔、阿姨、兄弟姐妹叫了个遍。这时又从厨房出来一位三十来岁留着板寸的女人，这时岳父介绍道：这是你姑！我一听是尼姑，连忙双手合十道：师太好！当时姑姑脸都黑了…………唉😔直到现在春节去她家拜年时都不愿意搭理我…………"}
{"author": "空城旧梦她与伞", "content": "媳妇娘家和我是同一个省不同城市的，相隔两百多公里，在外打工认识的。这几天，丈母娘在我家小住。昨晚，读小学二年级的儿子，几个简单的数学题，都做错了。我在一旁苦口婆心的说道：孩子，读书才是唯一出路，你看你老爸我，当年就是因为成绩差，初中毕业后，就进了电子厂打工，这么多年一无所获。丈母娘在一旁不乐意了：哟，还一无所获?当年我好好的一个闺女，不就是被你在电子厂，忽悠到手的嘛，连彩礼都没收你一分钱。"}
{"author": "低调_H", "content": "大海真的太可怕了,当时泰坦尼克号出海前,我喉咙都喊哑了,叫他们不要出海,他们不但不听,还把我从电影院赶了出来。[大哭]"}
{"author": "天热打鼓球", "content": "检查儿子作业，看他用黑字组的词，我很惊讶：你居然还知道黑大。他说：什么黑大，那是黑天啊！我仔细看了看，指着问：这顶上都看不到了，我还以为黑大呢？"}
{"author": "吃了两碗又盛", "content": "今天是2月14日。我走在街上，前面有两个小学生，其中一个说:情人节就是烦人，我爸我妈看电影去了，不带我。另一个说:你还算好的呢，我爸妈根本没告诉我他们去哪，"}
{"author": "璃白°", "content": "和老公恋爱的时候，第一次去他家，他父母十分热情，变着法子做一些好菜招待我。三天后的半夜，我突然肚痛难忍，老公慌了，以为是阑尾炎什么的，立马叫醒他父母，一起送我去医院。检查完，老公满脸焦急的询问医生，医生淡定的扫了我们几个一眼，说：屎太多，堵住了。我……[捂脸][捂脸]"}
{"author": "薄之凉", "content": "小明哭着说：如果我再考倒数第一，我妈就不要我了，她说我是网上免费下载的，把我送人了，她和我爸再下载一个孩子。老师：你也不用太担心，你妈是骗你的，你今年六岁半，你出生的时候，你家里还没有网络呢。小明：可是我爸妈习惯性蹭网，无论是商场、饭馆的网络，还是邻居的网络，她们都能蹭……"}
{"author": "孤心傲月", "content": "开车上班的路上，每天总会遇见一个骑着电动车的清纯漂亮妹子，每次我们相视一笑就这样一个星期 两个星期 三个星期我发现我爱上了她。这天我开车在路口等她出现，可是时间过了很久她还是没出现，就在这时候一辆红色保时捷911一个急刹停在我旁边，摇下车窗我惊奇的发现居然是那个女孩，我依然对她微微一笑……她大声骂道：你这傻叉！开个破奥拓还TM一见面就嘲笑我骑电动车，你以为姑奶奶真的没车吗！！！！！………………"}
{"author": "鲁智深暴打达文西", "content": "因为琐事，朋友两口子吵架，画重点，是朋友两口子。正好我上门，赶上了，看见朋友那上幼儿园的小棉袄一边哭着，一边劝架：爸爸，不要和妈妈吵架，不要和妈妈打架啊！你根本就打不过她的。"}
{"author": "聊天不撩妹子", "content": "经常听说婆媳关系难处，说是上辈子就是死对头。。。。。可我媳妇和我妈就是利外，我妈是彻底沦陷了，不管我媳妇和我妈说我什么，我妈听了都是一句话，嗯，这是儿子不好，得改。一次路过服装店，看到有套衣服适合老妈穿，就自作主张给买了，想着讨好讨好她，别什么事都帮老婆吵我。。想法是好的，事实是她知道老婆不知道我给买的衣服时，直接打电话告诉媳妇我藏私房钱了。。。。这都不是关键，关键是她就不告诉我亲妈是谁。。。。"}
{"author": "鲁智深暴打达文西", "content": "一朋友驾照教练，车技溜的一批，漂移那都是普通操作，特意学习特技准备从事影视行业。为了验证学习效果，他邀请我和他在练习场一起体验，还说每一个参与体验无不对他竖大拇指。怀着信任和感激动，坐上他副驾，各种安全措施，时而高速蛇形，时而甩尾漂移，时而陡坡飞空，在炫酷车技中我体验。。。突然安全气囊打开，碰的一声，车杵进。。。恍神中，看见医护人员抬着担架走过来，还窃窃私语:这是第八个不怕死敢来坐他车体验的。。。​"}
{"author": "璃白°", "content": "堂妹第一次相亲，我对她说：咱们新时代的女性，不要扭扭捏捏，要是看着喜欢的话，就果断下手。下午堂妹回来，却说没成功。我问道：对方没看上你，还是你没看上他?堂妹摇摇头：不知道他什么意思，话都没说一句，他扭头就走。我纳闷道：那是什么情况？堂妹：我就是按你说的呀，刚一坐下，看到桌子上有我最喜欢的红烧猪蹄，我果断下手，端过来就干掉一盘，没想到，他就这样走了。"}
{"author": "夏有凉风秋望月", "content": "提着两瓶酒，去舅舅家。年底，公 交车上人挤人，我没有座位，站在靠后 门的位置。一路上还有人上车，到舅舅家附近的公 交站台时，还有好多招手要上车的。司机没有开门，对着等车的人说道：挤不上了，真的挤不上了。我听到急了：师傅，开门啊，我要下 车。等我下去，听到司机师傅高兴的说道：好了好了，现在可以上三个人啦。"}
{"author": "吃了两碗又盛", "content": "我媳妇要写给儿子一些学习上的忠告，刚写下几个字就蹙起眉头，问我:那个成语怎么说来着？就是尿急离厕所越近越憋不住？我想了一下:哦，是行百里者半九十。媳妇:对对对！我懵住了"}
{"author": "吃了两碗又盛", "content": "过年，亲戚见面怕喝多？我告诉你，第一次见面就要先声夺人！让他们知道你几斤几两！久而久之就都不敢跟你喝酒了。简直是一劳永逸。当初我刚结婚，跟媳妇的亲戚们喝酒，来着不拒，倒多些喝多些，最后120把我拉走的，试问，现在快二十年了，谁敢跟我喝酒？"}
{"author": "吃了两碗又盛", "content": "外甥女在本地上大学，每到寒暑假前，总有外地同学养的宠物带不回去，找我外甥女帮忙寻个好人家寄养。我外甥女热心肠。去年带回来个小狗，放我小舅家，把我小表弟咬了，打疫苗，打狂犬病免疫球蛋白，花了两千多。今年暑假，外甥女自己被狗咬了，打疫苗，打狂犬病免疫球蛋白，花了两千多。这回寒假了，外甥女带回来个小猫，挺可爱，我儿子喜欢，就拿回家养，还上网买了猫粮，猫砂，铲屎工具，，，这些玩意还都没到货呢，我儿子就被猫挠了，流血了，这属于三级暴露，必须打狂犬疫苗，打狂犬病免疫球蛋白，花两千多。"}
{"author": "狐小乔", "content": "最近经常看到有人发这样的动态:冬天有三好，天气好冷，衣服好贵，我好穷。天冷了，谁借我1500块钱，让我买件羽绒服，分期付款15年，每年100，每月8块3，每天2毛7，我天天给你发红包，上午一毛三，下午一毛四，每天都是一生一世，天天有惊喜，每天有联系。我只想说:100÷12=8.**……8.3÷30=0.** ……你这账头挺好啊，算了两次，扣了两次差价。小数点后几位你给吃了?往里唬不往外唬啊……这买卖不划算，不干!😒"}
{"author": "偷惢前男友", "content": "昨天跟一对同学夫妻小聚，还带着他们三岁的孩子（3个都是同学）。然后那个女同学接了个电话，说跟你姐夫在xx街逛街呢。然后就挂了电话。       当时我们几个在一家店里看玩具，然后我那个朋友就说去趟厕所，一会去前面那个饭店吃饭，你们一会过来找我。这样就剩下我和他老婆还有他孩子。由于孩子比较调皮到处跑，女同学一人拽不住，我就拉着他儿子的另一个手，一起向前走。        突然有个陌生男子走到女同学面前说：姐姐，你们刚才三个人手牵手的时候我已经拍了照片。今天这事我就不告诉姐夫了，你怎么可以背着姐\n…\n查看全文"}
{"author": "薄之凉", "content": "过年回家，去澡堂子洗澡，服务员说她们有祖传配制秘方，香喷喷搓澡，每位38元，我想体验一下。搓澡师傅很卖力气，搓下很多泥，然后他开始向我后背展示“祖传秘方”——生抽、老抽、蚝油、料酒、花椒油……一通搓！我冷笑问：师傅，你忘了放葱花了。师傅说：火候没到，等你汗蒸时才放葱姜。我：你拿我当红烧肉了？你们祖上是做什么的？搓澡师傅：宫里的御厨……"}
{"author": "夏有凉风秋望月", "content": "我的闺蜜为了她心仪的男神，总是想方设法的把自己打扮的漂漂亮亮的，只要有一点靠近男神的机会，就一定会带着我跟她一起！她说因为我的体重可以让她有 安 全 感！时间久了，我和闺蜜的男神也渐渐的熟悉起来了！再后来，我闺蜜就离我越来越远！"}
{"author": "耍流氓是很優雅滴", "content": "核酸检测，做完出门遇见两个老太太，其中一个问我：“同志，‘核试验’在哪里做？”"}
{"author": "XX青春", "content": "做完核酸检测，我问医生去哪里拿检查结果，医生跟我说你不用去有问题我们会开车去接你……"}
{"author": "《龙哥哥》", "content": "真人真事   并无虚假十二年前我朋友病世，临终之时其六岁的女儿托付于我，认我为义父！十年前我十岁的侄子为了上学方便，住在我这里！今天中午一起吃饭的时候我侄子跟我说；他俩谈恋爱了，想让我同意！我自然是同意，只是你俩现在应该以学业为重，才能给对方更美好的未来！所以我现在在想一个问题，你俩以后管我叫啥？"}
{"author": "天热打鼓球", "content": "带儿子学琴的路上，会经过一个路口。有一个老大爷常在那里拉二胡乞讨，且来来回回就是那两首曲子。有次突然感慨谋生不易，想到儿子又不好好练琴，于是恨其不争的问他：你看，心里有什么想法没？儿子想想说：有啊，其实不用学得那么累，只要会两首简单的曲子就能出来挣钱了！"}
{"author": "程枂儿", "content": "邻居家上小学一年级的小子，趁他妈午睡的时候，用剪刀咔嚓把他妈留了几年的长头发给剪了，拿给楼底下收长头发辫子的大爷，换了一百多块钱，当天就请他们班的两个小女生去吃了KFC。现在整个小区的住户，家里有长头发的，都把剪刀给藏了起来！"}
{"author": "孤心傲月", "content": "今天我生日媳妇给我买了块劳力士。媳妇说：有人在淘宝花50块买了块劳力士，但是我咋可能给你买那种价位的表呢！我在拼多多25块就给你买到了……我：媳妇，我想静静…………"}
{"author": "无书斋主", "content": "昨晚，一友招待客户，我作陪，酒量一般的我，面对几千一瓶的酒不能免俗，过了量！！上厕所的时间，刚蹲下来听见隔壁位传来一个女的接电话声音！跟着，这女人时来时进，就没断过！……我特么，蹲了快一个小时才跑出来！……大家以为我进的女厕所吧？？如果不是蹲久了腿麻，我特么要揍这老板一顿！！这厕所不分男女，公用！！……"}
{"author": "叶vVv枫", "content": "早些年打网 游，工 会里集体开麦语音通宵刷Boss.夜已深，大家都昏昏欲睡。忽然，语音群里，工会的奶 妈朵朵说:“我去嘘嘘啊，大家先不要刷，等我一下。”恰巧这个时候我饿了，想去泡面，就顺口来了句“好饿哦，我去泡面。”顿时群里沸腾了:“叶枫你 口 味 好 重啊”“就是，人家朵朵嘘嘘你就要泡面，挺知道节约用水啊”……你们……你们……我……我……"}
{"author": "上天揽九月、", "content": "我给自己的小店印了点广 告，偷偷贴在小区里。没过两天，物业找上门来说：“广 告已经清理干净，以后别在小区里乱贴广 告了。”我尴尬的一边道歉一边保证以后不会了。末了，我问物业：“你们怎么发现是我贴的广 告？我反侦查措施应该做的挺严密的！”  物业：“你广 告上有电话号码，我们跟业主的联系方式一对比就找到你了。”我…草率了~"}
{"author": "中国加油！！", "content": "给女同事打电话，听她的说话气喘吁吁的，我说：你先忙吧！但手机也没挂，没想到她也没挂，我把手机贴近耳边，就听到电话里传来的喘息声...大概过了20分钟，电话那头女同事笑着说：听够了吗？我跑了足足20分钟！"}
{"author": "寒山宽洪", "content": "老家有个讲究：路上看见帽子是不能捡的，那是别人故意丢掉的“愁帽”，按规矩要跺上一脚，吐口痰，才能远离厄运。我同学有一次就遇上这种情况，边走边玩手机呢，瞥见脚下有一顶鸭舌帽，顺势就在帽子上跺了一脚，吐了口水，没想到屁股后面被人狠狠踹了一脚，他扭头刚想发火儿，眼前立着一位脖子上有刺青的黑脸大汉，厉声喝道：操！我帽子跟你有仇吗？！后面就是派出所的事情了……"}
{"author": "就是疯子我", "content": "今天开车路上一老头在路中间走，我鸣笛，他居然骂我！于是我把车开出挺远挺好，下车和他保持三米距离，骂了他半个小时，"}
{"author": "花开二零二一", "content": "少年时的一个春节，我手里拿着个炮竹，在村里遛跶，惊喜的发现目：一 泡 牛 粪！！紧急越过前面的二大爷，就要把炮竹 插 进牛 粪时，二大爷一拐杖把我挑翻在地，我以为他会批评我不学好，谁知道他说：小崽子，欺负二爷脚脚慢是不？这 牛 粪是我先看到的！！！说毕，掏出一个轰天炮，颤颤巍巍的插进 牛 粪，点燃。。。。轰的一声！！！然后，二大爷驾着“翔”云向我爷爷告状，爷爷连敲我三烟斗，边敲边骂：这么好玩的竟然事不叫我！！！"}
{"author": "山鹰寂寞飞", "content": "小时候，电视里播放清宫剧，姐姐入了戏，总是自称格格，还问我她像不像清朝的格格？我幼小的心灵哪知道格格贝勒的区别，觉得不像，因为她跟清朝人相比，差了一个瓦亮的光头和一根辫子。过年那天姐姐喝醉，坐太师椅睡着了，爸妈打牌去了，我想起姐姐要做格格的心愿，帮她完成了伟大的梦想，用老爸的剃须刀，先从她额头的刘海刮起，慢慢地刮出了个清朝人的秃老亮，在脑后盘了根大长辫子……那一天，全村人都说看见了一个清朝人屋前屋后在追打一个孩子，跑的太快实在分不清谁和谁……"}
{"author": "义行天下7", "content": "哥们小张经 常 在外出 差，全 国各 地的跑！想 到  新 .  冠  . 像 打 游 .  击一样，时不 时的出现，我就关 心 的提 醒 小张： 哥 们，在 外 要 保  护  好自  己，千  万 不   要    中 .   招  啊！小张 不 屑 的 回答 ：没 事！我  随  身 带 着  雨  .   .  衣  呢！"}
{"author": "降智咸饼", "content": "小侄子放学后。兴冲冲地跑进家门。边跑边叫道：姑姑姑姑，我告诉你一个好消息。我问道：难道你考了100分？小侄子弱弱的回答道：说了是好消息，又不是奇迹……"}
{"author": "偷惢前男友", "content": "今天在沙发上打游戏，媳妇在旁边陪儿子看动物百科大全，其中介绍了布谷鸟的事。儿子说布谷鸟很聪明，把蛋生在别人的窝里，这样其他的鸟会以为是自己的孩子，让他们养大自己的孩子媳妇趁机教育儿子说：你以后要是在调皮捣蛋不乖的话，我也会把你放在别人家里哦。儿子说，也许我就是别人放在你家里的小孩呢？然后我好像听见巴掌声，突然儿子就哇的一声哭了，发现媳妇一脸紧张的样子狠狠的盯着儿子看......."}
{"author": "忧郁的创可贴", "content": "“我喜欢看天，看海，看山，看树，看烧云垂暮，看星斗落尘。。。”“你特么开车给我看路 ! ! ! ”​"}
{"author": "红豆红%", "content": "去参加表弟婚礼，看到表姐的一对双胞胎女儿，问她们“你俩谁是姐姐，？”个子矮的那个举手说我是姐姐，我“宝贝儿，你咋比妹妹还矮呀”，小丫头不开心了“高矮和胖瘦美丑一样，不是人可以选择的，就像你和我妈妈是表姐妹，我妈妈又瘦有好看，你呢？”"}
{"author": "高冷的小门神", "content": "打扫卧室，静候女友大驾。老哥说楼主收拾自己狗窝的样子，像极了一只忙碌不停的燕子。我拧干抹布，给自己擦了把脸，气喘道：以前是狗窝。现在恋爱了精贵着呢，以后我的房间就叫“燕窝”。“燕窝”得有唾沫，于是老哥对着我吐口水，呸………"}
{"author": "九头纪", "content": "大一时，某个深秋的夜晚，我们都无睡意，大伙就聊天，就说到了村 官 的事上，姐就对宿舍人说，姐老家有一女的长的很丑，但是很有能力，是一个非常好的 村 干 部，只是因为长的不怎么样，一直到现在还没有结婚。这时，宿舍里有一位长的也不怎么样的女孩问我，长的跟我一样丑吗？姐当时神 经 大 条了，想也没想，脱口而出: 那倒不至于…"}
{"author": "鱼歌浅唱", "content": "周末，老妈wx群喊回家吃鲅鱼馅饺子。兴冲冲赶回去，只看到厨房一条解冻好的大鲅鱼……整理好鱼肉，依次放入花椒水、鸡蛋、五花肉馅、韭菜碎、各式调料……努力搅拌着一大盆肉馅，感觉手腕都快断掉了“妈，您需要一台搅拌机……”老妈抬眼瞅了瞅刚刚回家的弟弟弟媳，嗓音嘹亮:“嗯，咱家还缺台洗碗机！”"}
{"author": "我是谁∽谁是我", "content": "前段时间去朋友家聚餐，临走时朋友送我一块劳力士，说是朋友从香港带过来给他的，并且说是假货不值钱戴着玩吧。。。前天搬砖没注意把表面玻璃磨花了，不好看了，早上拿去修表店，让给换个表面，修表师傅拿过去看看，说换不了，这表得去专劳力士专柜定做。我告诉他这是假的，朋友送我玩的。他认真的看看表，又认真的看看我道：我给你十万，这表卖我吧？我给他说：如果是真的，我得还朋友去，不敢卖。连忙要回手表。送还朋友时，朋友从手上脱下手表说：我是两块一样的，外行根本看不出，就是怕戴错了才送一块给你的，算了这个送你吧，\n…\n查看全文"}
{"author": "花开二零二一", "content": "表弟大学了，放假到我家吃饭，老妈问他：谈女朋友了吗?表弟笑笑:学业为重，毕业了再谈。老妈看了看我，叹了口气，道:在动物园里打猎都打不到，出了园子你还能打着?……"}
{"author": "爱新觉罗.黄瓜", "content": "工地放假，准备回家。媳妇让我​回家的时候买点吃的，最好是买那种耐储藏，全家人都能吃又耐吃的东西。我思前想后琢磨了好几天…买了5袋盐回家…​"}
{"author": "南九", "content": "昨天跟单位几个同事庆新年聚餐。咯咯咯……喝得有点多，我特意敬老赵一杯酒：赵哥，这两年来，你一直是我段子里的主角，我把你的糗事都发到网上了！你不会怪兄弟吧……老赵醉眼迷离，端起酒杯轻嘬了一口，然后对我说:兄……兄弟！网上谁认识我呀！多大点事儿啊……我没事总找领导打你小报告，你不会怪哥吧……"}
{"author": "狐小乔", "content": "“闺女，你啥时候放假，快点回来啊，我给你做好吃的。”隔着电话就能感受到老妈盼我回家的热情。“好，一放假我就回家。”终于回家了。“哇塞，老妈你做这么多好吃的呢？”“那当然，我老闺女好不容易回来，必须好吃好喝的伺候着。”老妈说。“行了，快吃吧，从早上开始就没给我做饭，都饿三顿了。”老爸喊道。"}
{"author": "爱新觉罗.黄瓜", "content": "媳妇感叹，说是下辈子一定要找一个会做吃的还会挣钱的男人嫁了。我告诉她：“武大郎符合你的要求，不但会做炊饼还会卖炊饼！”唉！女人啊，说不过就动手动脚，一脚将我踹到床下去了…"}
{"author": "紫子知", "content": "现在能见面的赶快见面吧，再过一段时间再想见我就难了，我说了不算，得村长同意，得政府同意。[捂脸][捂脸][捂脸]"}
{"author": "爱新觉罗.黄瓜", "content": "门口来了个收废品的，小喇叭里嚷嚷着：废书废纸换烟花爆竹！我儿子收拾了一堆废书作业本，其中居然还有前几天才发的寒假作业。​收废品说他，寒假作业不能卖。我儿子霸气回应：“没事儿，我妈给我准备的还有！”​儿子的小伙伴，从家里收拾了二十几张奖状。收废品的：“奖状不能卖！”​儿子的小伙伴​：“这些都是前几年的。我一学期好几张呢，家里最不缺的就是奖状！”​"}
{"author": "聊天不撩妹子", "content": "有些风俗真的应该废除了。比如新娘子进男家门，脚不能落地，还必须是新郎抱进门，瘦媳妇还行，要是胖的！！哼哼！！前段时间天冷下雪，本来婚车是可以到门口，因为路面结冰，新郎抱着新娘走了八百米，当天晚上两人同时住院，一个吐血，一个骨折。。。"}
{"author": "寒山宽洪", "content": "女儿教我玩微信，办卡，绑卡，发红包，前两天又教我学会了A丅M机取款，今天去实地操作，没想到里面的钱已经被我玩完了！[大笑]"}
{"author": "捉女妖的天师", "content": "现实中的抓，捕，行动J灯根本不会闪，连车灯都不会亮，N多年前一个月黑风高的夜晚，我骑的破驴子就怼上去过[笑哭]"}
{"author": "聊天不撩妹子", "content": "老婆娘家是重庆的，喜欢吃火锅，元旦休息三天，两天吃的火锅，火锅底料是小姨子邮来的，这次寄过来的超辣，我吃都是用清水涮一下才敢吃，老婆也是两顿被辣的泪流满面的。昨天问她中午要不要吃火锅了？她说不吃了。。结果是中午吃饭委屈巴巴的道：你几十岁的男人白做了，难道不知道女人说不∽∽就是要的意思吗？我！啥也不是。。。"}
{"author": "薄之凉", "content": "研究生毕业的时候，买了一双皮鞋，基本没穿过。马上要结婚了，找出来擦擦，还挺新，婚礼的时候穿应该还不错。婚礼当天，穿着去接亲，路上还好好感受了一番，依然相当有型，不禁感叹这质量简直好炸了！然而，我一直在想，我可能是人类历史上第一位拎着两片鞋底走下婚礼的新郎了吧……"}
{"author": "leo咫尺天涯", "content": "这次面试我可能又玩完了，因为面试官被我整崩溃了。　　“姑娘，你民族和性别填反了我忍了，我敬你是条女民族的汉子，可你把出生日期九年和教育程度一九九九年填反了我如何忍你，这要是真的，你母亲该是多伟大，给你胎教了一千九百九十年，山海经都不敢这么写，封神榜都不敢这么演啊！”"}
{"author": "倾心倾情%%", "content": "上一年级的小侄女回来了，我问她我美吗，她说我丑死了！给她送上礼物，又问她我美吗？她说我很美！我说她也太没原则了，她振振有辞地说道:小姑，大家都是女人，心口不一很正常！小人精呐！"}
{"author": "夏有凉风秋望月", "content": "从102到295斤，决定减肥. 减肥第一天，腿着来单位，走了一个多小时，出了一身汗，感觉还不错，心里想着中午吃还是不吃……然后老妈来了，带着烧鸡[色]这还没到中午呢[捂脸]，吃吧吃吧，也不差这点儿！ 这可真是难为我了，吃吧，好不容易下定的决心，就这么没了，不吃吧，又怕伤了老妈的心！见我犹豫着，老妈捞起鸡腿就塞进我嘴里……"}
{"author": "骑着二哈啃黄瓜", "content": "我们街上的暴躁闺蜜吵架，暴躁闺蜜人把对方揍飞两米远，赔了8000，这一下可声名鹊起威名赫赫名满江湖了，现在街上的人见了暴躁闺蜜都会说“年关将近极度缺钱，x姐你能不能给我一拳?”"}
{"author": "吃了两碗又盛", "content": "看电视剧，小外甥说他也会演，我们把电视暂停鼓掌欢迎。只见他用手搓了搓脸，情绪马上就来了，眼泪在眼圈里打转，用颤抖的手斜上45度指着天花板说:我，嬴异人，质赵八年，质赵八年啊！！可能是用力过猛吧，他这句怎么听都是“智障八年”，再配合他9虚岁的年龄，把我们都笑疯了。"}
{"author": "净心居士", "content": "大家好，我叫净心居士，大家都叫我净身居士，反正不管啦！一个代号而已。众所周知我还有一个外号叫大黄，所以你们只知道我姓黄，却不知道我叫啥！说起我的名字，说多了都是泪呀[大哭]，今天我厚着脸皮告诉大家，我父母一直希望有一个女孩，以至于我出生的时候听说有个小尾巴，当机立断给我取了个叫来凤的名字，希望接下来是个女娃。"}
{"author": "狐小乔", "content": "有个不靠谱的闺蜜是什么体验？二货闺蜜，趁着春节出去旅游，一天晚上临睡前兴致勃勃致电给我：小狐狸，我遇到一座庙，老多人上香了，据说嗷嗷灵验，我特意替你磕了三个头，保佑你颈椎快点好转，财源广进，就问你我贴心不？我为了报答她，让她尽情玩，我在家咣当咣当砸着键盘帮她写书。结果，两天后，她哭唧唧地小窗我了。小狐狸，对不起啊，我今天才知道那庙是求子的。差点忘了，就是这个瘪犊子发错视频，让我个重度颈椎患者大汗淋漓的丰胸一个月，关键还不管用。你这是一计不成又生一计，把我往死里整啊！"}
{"author": "乜乜宇", "content": "终是金莲长得俏 大郎含泪喝了药终是借呗到了期 步步都往死里逼"}
{"author": "夏有凉风秋望月", "content": "楼主体重295，有点小胖，平时很少能买到合适的衣服，一般都去定制。那天去店里看到一个新来的店员，跟他说了我的要求以后，他说价格有点贵，差不多两千！我一听确实有点心疼，正在犹豫着，店员一脸嫌弃的说，给你个建议，去路边摊买三件最大码的衣服，然后找个裁缝店改改，能省三分之二！我一记飞刀眼过去，他立马噤声！这是瞧不起谁啊，真的是！为了找回面子，我一狠心，一咬牙，说来三套！交完钱，走出店门口，我回头一瞥，看见了那个店员狡黠的笑！"}
{"author": "上天揽九月、", "content": "睫毛夹坏了，夹睫毛时不小心把睫毛拔断了。男友安慰我：睫毛3到5天就可以重新长出来，他还怂恿我把另一侧也拔了，这样两侧长出来一样长。我一狠心，把另一侧睫毛也拔了，刚拔完就看到男友捂着肚子快笑抽了…"}
{"author": "夏有凉风秋望月", "content": "闺蜜说带我见见她男友，给她把把关！闺蜜的男朋友把饭店在选在风景如画的半山腰上，在上山的路上闺蜜说也要给我一个惊喜，我嗔怪说怎么不早说，要去山上我好穿条裙子，仙仙的感觉！闺蜜说穿裙子干嘛？我说穿裙子方便啊，，，，，闺蜜告诉我说，知道你喜欢吃，我特意让她男友把这里最有特色的美食都点了，所以说你穿什么都不影响你吃饭！特么的，我还以为要给我也介绍一个男盆友呢，是我想歪了！"}
{"author": "天热打鼓球", "content": "快晚上十一点了，隔壁的少妇过来借剪刀。我顺嘴问了一句，干嘛用啊？她叹了口气说：都怪老公不中用！我大惊失色：再不中用，也不能下狠手啊？她噗呲乐了，横了我一眼说：———"}
{"author": "夏有凉风秋望月", "content": "领导最近心情不好，天天找事儿，每天过的提心吊胆的，那天领导让我出差，这下可把我高兴坏了，每天不用再受那个老女人的啰嗦了！到了目的地，我找了一个酒店住下了，放下随身的行李，我一下子就扑到床上了，只听咚的一声响，我把床压塌了！捂着快断了的腰，我龇牙咧嘴的站起来，打电话给客服客服要求换床和赔偿我的医药费！没想到客服居然领了几个大汉上来，要求我赔偿床的费用！一个人在外哪里见过这样的场面啊！吓的我交了钱，赶紧走了！然后给领导打电话，问这钱能不能报销，领导在电话那头歇斯底里的咆哮：胖丫啊胖丫\n…\n查看全文"}
{"author": "吃了两碗又盛", "content": "最近我身体出了点小故障，在医院开了药，回来打肌肉针。我媳妇社区医学专业毕业的，打针是熟练工。可是她给我扎针的时候，左比划右比划，甚至拿笔在我屁股上画辅助线，才能找准扎针的位置。我问她你原来是怎么打的？也这么费劲吗？我媳妇说患者哪有像你这样的，他们都只把裤子退下来一点点，那个位置就是对的。嗐，那还画什么辅助线啊，我把裤子提上不就行了。"}
{"author": "偷惢前男友", "content": "亻尔 矢口 辶首 今 天 有 夕夕 冫今 口马？冫今 至刂 我 扌丁 白 勺 字 者阝 衤皮 扌斗 昔攵了. . ."}
{"author": "『空欢喜』", "content": "今天教练带我们去考场模拟科目三考试，车上有4个学员。路上看到一辆后面贴实习标示的车辆，本来红灯可以右转弯，斑马线上又没有行人，可他偏等绿灯亮才起步，教练在后面等得发火了:这是那个猪教练教的？？？怎么那么傻？？？在一个路口停止线停车，那司机是个女的，她看到教练连忙打招呼：教练你又带学员去考场练车啊？？？教练脸憋的通红说:嗯对呀……我们在车上憋出内伤……"}
{"author": "无书斋主", "content": "自从进入了冬天，每次下班老婆都会给我一碗热稀粥：老公，外面冷，暖和下身子！……咕隆隆，我一口喝下，老婆放了牛奶的稀粥，很香！我，很幸福！今晚，儿子睡觉前的牛奶没有喝完，我要倒的时间，老婆：别到了，明天给你熬粥！！……我……特么，难怪你自己不吃！！"}
{"author": "义行天下7", "content": "家里养了条藏 獒，这不冬天来了，怕它冷，就用铁 皮+钢 管精心搭建了个非常漂亮的狗 窝，外形酷似房子！这天侄子来我家玩，看到如此漂亮的狗窝，说这么漂亮的房子给狗住，我也要进去看看！拗不过，我只好作陪一起过去，哪知道离狗还有好几米左右的样子，藏獒就“汪、汪”的挣着铁链往侄子方向扑，吓的侄子直往后退！侄子吓的脸都变 色 了喊到：叔叔！算了，我就不进去看了，“房 东”不同意！我当时没反应过来，居然脑 抽的回答我不是同意了吗？？？"}
{"author": "吃了两碗又盛", "content": "小外甥怕狗，怕的要命，哪怕是不丁点的小狗。-----以上算是背景---我妈那窗台有一块大理石活动了，小外甥接近窗台时我怕他坐上去，就提醒说:别坐窗台，那有一块大理石是活的。小外甥立马炸毛，连滚带爬地跑了，完后问我:那他咬人吗？"}
{"author": "我是谁∽谁是我", "content": "公司本来是两个设计时，前段时间因为他太狂被老板开了。年底一工地交工验收，甲方要俊工线路图，老板让我配合设计小张画图，今天必须赶出来。正忙着小张新交的男友来了，小张跟男友说：你上班时间过来干啥，不怕你们老板板炒你鱿鱼？她男友道：你就放心吧，他炒谁也不敢炒我。小张问：为什么？他男友：因为我差老板老多钱了，老板娘说了只要是跟女友约会，就算上班工资照发。小张：你老板娘这么好，我辞工到你们那上班行吗？小张男友：只要愿意，随时都可以，都不用跟老板说，我早就跟老板娘商量好了，至于工资你放心吧\n…\n查看全文"}
{"author": "芭蕉窗下听雨声", "content": "当年在泉州时认识一家庭背*景深厚的人。每天晚上一起喝酒时就跟我炫耀他又得到了几个美女青睐。可他有一好老婆，几次劝不下来，我就吓唬他说：小心你老婆送的十周年钻戒被人偷了。谁知第二天他就把钻戒加固给我看了。我说：你还有几颗纯金的金牙，是不是忘了？谁知他咬着金牙一脸懵的问我，那怎么办啊？[笑哭][笑哭]"}
{"author": "『空欢喜』", "content": "我妈跟我说，在生我不久后，拿我八字到镇上有名的瞎眼神算那里算命。他说我命犯天煞，克夫命，谁跟我谈恋爱，轻者残疾，重者丧命。我就跟我妈说别迷信， 那就一瞎子能算的出什么 ？？？事实上第一个男朋友工作失误手被毁一只，剩下一只手；第二个男朋友发生了车祸，双腿截肢；第三个男朋友去爬山时摔没了，第四个男朋友触电也没了现在想想那糟老头子真的很厉害 ，这都能算到，搞得我现在都不敢谈恋爱了最近妈妈给我一介绍一男朋友，​我本能的拒绝，妈妈耐心的介绍说:这个男的\n…\n查看全文"}
{"author": "骑着二哈啃黄瓜", "content": "公司年度大盘点，我本来就很多事，还是被强制安排去9区域复盘。。。到了指定区域，发现闺蜜也在，不过我忙说了几句客套话，就没理她，她看了看我忙着复盘，知趣的也没打扰我。复盘才发现这盘的什么鬼，每一个对不上，只能把清单上没有的东西全部加到清单后面，足足四页A4纸。盘的差不多的时候，闺蜜讪讪的又过来了，关心的问我：终于盘完了啊？我松了一口气：嗯，用了劳资两个多小时。闺蜜接过我清单，喵了喵复盘结果，说：做的不错，谢谢哈，你的复盘区域在\n…\n查看全文"}
{"author": "七彩小逗子", "content": "今年22，16岁就辍学打工，奋斗了6年，如今有房有车，父母没有拿一分钱，全靠我自己，一年前还交了个58岁的女朋友"}
{"author": "天热打鼓球", "content": "那是一个夏日的午后，我暗恋的女神被人抛弃了，她一个人在下着雨的操场上走着。我很难过，真的！可我不知道该怎么安慰她！于是，我也冲进雨中，陪着她一起走，一圈又一圈！也许是我的傻和坚持，又或者是淋雨后的狼狈模样，女神突然噗呲乐了，嗔怪着对我说：傻瓜，我没事了，你快回去吧，衣服穿那么少，都看见肉了，一点都不爱惜自己的身体……我害羞的点点头说：你也是！"}
{"author": "我不做人啦JOJO…", "content": "办公中。听见旁边的垃圾桶窸窸窣窣作响，我以为是保洁阿姨来了，正准备转身跟阿姨问声好。猛一看原来是行政小姐姐，我急忙刹车：阿......今晚天气真好。虽然行政小姐姐脸上挂满了关爱弱智的表情，但她不知道我刚刚经历了一个死亡转弯。"}
{"author": "花开二零二一", "content": "开工第一天把开机 密 码忘了面对电脑，我大脑空空，过个年过失忆了问了一圈加翻聊天记录，把密 码找回来了，惊险"}
{"author": "北堂灵梦", "content": "人生最大的悲哀莫过于，我还在出差，同事打电话告诉我公司倒闭了……欲哭无泪啊！"}
{"author": "段子手阿菲", "content": "老太太进城妈妈晕车怕出远门，十年里从来请不动她来南京玩，这回她终于答应了，我怕她反悔立马买了票，她收拾了一大箱她觉得好看的新衣服，来到南京一看觉得太土了，一件都穿不出去，赶紧叫我带她去买，还赶紧把头发剪短，哈哈哈更搞笑的是，带她出去玩，她老说好像在新加坡？我说大城市看起来都差不多。她看到参天大树就会说，砍来做柴火多好啊！看到湖里密密麻麻的红鲤鱼又说可不可以捞一条红烧？……去中山陵走了很远，她瞪大眼睛问，哪里有古墓？我说整座山就是……带她下馆子她说好贵。给她拍照她扭捏，其实甭提多高兴……游\n…\n查看全文"}
{"author": "空城旧梦她与伞", "content": "那时在工厂上班，租了一房一厅，对门是同事陈哥夫妇。陈哥的妹妹没找到工作，在陈哥家住了一段时间，睡客厅的沙发。那天，他妹妹敲开我房门，楚楚可怜的说道，没找到工作，心情烦闷，在沙发上翻来 覆去，竟然把沙发睡 塌了，被嫂子一顿痛骂，今晚是无家可归了。听完后，我立马把门关上，什么人啊，把自己哥哥家沙发睡 塌了，现在又想睡 塌我家 沙发。"}
{"author": "醉酒舞剑砍疯子..…", "content": "经常看闺蜜对着她老公撒娇。我就学人家拽着男友胳膊撒娇，结果把男友胳膊晃脱臼了！我让男友发誓不能让他家里人知道！太丢人了[哀怨]"}
{"author": "穿裤头去打醋", "content": "情人节，跟老婆出门逛街，路过花店，想进去买束鲜花送给她，看到价格11支鲜花包好要198元，老婆就给我说，买那干什么，平时3_5块钱的东西，现在这么贵，有那200块钱，能买多少好吃的，别花那冤枉钱了。你上班这么辛苦，我不要你给我买东西，只要你疼我就够了。老婆的一番话说的我顿时感动不已。然后刚感受到幸福两分钟，她转身拉我去了苹果店，用我工资卡刷了一个她念叨已久的手机。  哎，大意了。"}
{"author": "男渣医生医渣男", "content": "最近和朋友聚会大醉一场，老婆非常生气，后果非常严重：好几天不理我，怎么说话都不搭理。昨天晚上半夜我装作梦中哭泣，抽抽搭搭好一阵，老婆惊醒后听了一分钟，踹了我两脚：“大半夜的干什么!还让人睡觉不!”我一把抱住老婆：“媳妇儿，我梦见你非得和我离婚，吓死我了，就哭了……”今天早晨老婆给我做的鸡蛋面[捂脸][捂脸][捂脸][捂脸][捂脸]"}
{"author": "坏小孩cium", "content": "大二的时候有一次胖哥要和我分手，我说那必须的吃一顿散伙饭我才能同意。。。吃完我俩被留在饭店刷盘子，一个多月都没分成。。。。"}
{"author": "喂-你好吗", "content": "老公问我想吃什么他现在在凉皮店呢我：麻辣烫.糖醋.加粉丝.少麻.多辣！等他带回来我吃的时候，麻的我就下不去嘴我就问他你是怎么跟人家报的饭？请复述一遍老公挠挠头：你说的那么绕口，可能.估计.是我给报反了吧？我：这很难记吗？老公：我们男人吃饭可没那么多讲究！那都是，老板来饭凉皮！老板来碗麻辣烫！我：老板要是问你麻辣烫要多麻少辣还是少麻多辣？糖醋还是咸的呢？加烩面.方便面还是土豆粉.粉丝，烩面要宽的，还是窄的？老公：哪那么多事，我就想吃碗麻辣烫！"}
{"author": "给国军太太送个信", "content": "刨出一件古老的衣服穿起来，觉得口袋里边好像有纸片，心中暗喜——原来我也会留了钱在口袋里边儿。掏出来一看，不是钱。但也可以算钱吧——是张借条。想了一下，还是不能算钱，白开心了。借款人是老婆。借款时间是刚认识她不久。"}
{"author": "千丝雨ベ万人迷", "content": "最近和室友吵架了，谁也不理谁的那种。然而看到她被狗狗追的时候，有了恻隐之心，上前赶跑了狗狗。和室友和好如初，她买来蛋糕让我吃，我高兴的正要张口吃，她把蛋糕拍我脸上了!"}
{"author": "骑着二哈啃黄瓜", "content": "每次回家，妈妈总会做一堆好吃的菜，然后荤类的如果第二餐没吃完一般会选择倒掉，这是父亲的规矩，父亲觉得肉类加热太多次酸性成分太多，伤胃。虽然回家没用，公司电话经常不断，吃个饭电话不停，吃饭被打断，每次都是最后一个吃完。母亲要先收拾碗筷洗碗，父亲帮着收拾给我留了一份大骨汤，其他的大骨肉就准备丢了。趁着我电话当儿，母亲拦住了父亲，把大骨肉对着家里金毛比划，金毛看了下头撇向一边表示不吃，然后母亲把手里的大骨肉放进我汤盆，亲切说:女儿你就多吃点，在外吃不到这\n…\n查看全文"}
{"author": "千丝雨ベ万人迷", "content": "同事喜欢穿男士衬衫当睡衣，宽大又舒服。可是老公出差了，不敢买怕他误会。我说，那就买你老公的尺寸，等他回来说是给他买的。同事欣然同意，我说也给我买件，我也试试当睡衣穿。过了半个月，她老公回来了，和她一直在吵架，她老公一直纠结，为什么给他买的衬衣是穿过的，小票显示购买了两件， 为什么家里只有一件"}
{"author": "程枂儿", "content": "小学二年级的时候，有次我不听话，妈妈恐吓说要把我卖掉，语气特别严肃，我当真了。去学校以后，我哭着把这件事告诉了班长，结果放学后他告召全班同学到我家去求情。当一大片孩子跪在地上时，正在打麻将的妈妈彻底惊呆了…"}
{"author": "正版煮茶", "content": "去游乐场玩，人山人海。到处都在排队，上洗手间也排长队，我玩着手机排在一个大哥的后面，排了大半小时后，才发现大哥是个短头发的女的，比我还高，一扭一扭的进了女洗手间..."}
{"author": "狐地瓜大人", "content": "晚上泡脚，老婆指着手机里的图片说：“这个种蘑菇的有点意思，浇水就会长蘑菇，我们买个玩吧！”我看了眼价格，跟媳妇说：“这有啥稀罕的，你找个花盆，把我这盆洗脚水倒进去，也会长蘑菇。”老婆没得逞，把洗脚盆端走凶狠狠的说：“我现在就去种蘑菇，种不出来你就死定了！”我无辜的问：“要是种出来呢？”老婆：“种出来就给你煮蘑菇吃！”"}
{"author": "狸土豆大人", "content": "高中的时候早恋，被班主任发现叫去谈话。他对我说：\"我也是从你们这个年龄过来的，我都懂，可是现在不是耍朋友的时候，目的只有一个，那就是全心全意学习，努力考个好点的大学！”我小声嘀咕了句：我也没耽误学习啊！班主任扶了扶眼镜，接着说：\"那么我给个建议，你可以转移注意力，把你对他的喜欢，化为学习的动力，每次想他的时候，就做一道数学题，因为你数学最差，这样既能提高成绩，还能作为你对他感情的见证，以后给他看，他一定会很感动！\"我觉得班主任实在太好了，非但没强力阻止，反而还\n…\n查看全文"}
{"author": "吃了两碗又盛", "content": "小外甥对距离的理解是这样的，给手机充电一定要用最短的数据线，玩游戏一定要把手机放在路由器的四个天线中间，，，，，"}
{"author": "义行天下7", "content": "本人烟龄十多年，每天两包 烟到不天黑，一直戒不掉，这天又因为抽烟过多咽喉不舒服去看医生！医生拿个手电让我张开嘴，仔细看了下说没啥大问题，把烟戒掉就好了！我为难道：这个还真不好办啊？抽了十多年了，戒了好几次没戒掉！你有啥好法没？医生：你犯烟瘾时吃槟 榔吧！保管你戒掉！于是回家我就买了一箱槟榔，烟瘾发作时就吃槟榔，一天能吃两包，慢慢的把烟给戒掉了！可吃了约几个月后，感觉口腔不舒服，热了不能吃，凉了也不能吃！又去医院看医生，医生拿个手电让我张开嘴看了下口腔，说少吃或不吃槟榔最好，我忍不住\n…\n查看全文"}
{"author": "狐小乔", "content": "师兄生性严肃，不苟言笑。今天早上病房查房时被一个老太太投诉了，说他长得又丑又凶，活脱脱的一个钟馗，把她给吓到了。师兄说，大妈，钟馗是捉恶鬼的，你没做亏心事，怕钟馗做什么？？？然后，查到下一个病房时，师兄努力地做到了面带微笑，结果，又被一个老大爷投诉了，说他总是在笑，没有切身体会他们作为病人的痛苦，而且笑得比哭还难看，是在幸灾乐祸……"}
{"author": "吃了两碗又盛", "content": "我爱忘事，有时候就让我媳妇帮忙记着。今天，我媳妇问我:上两天你让我帮你记什么事来着？我想不出，累的脑瓜疼。我媳妇也累的脑瓜疼。我想，以后再也不让我媳妇帮忙记事了，让她记事我还得记得让她帮我记什么事。"}
{"author": "聊天不撩妹子", "content": "一人在外不想烧饭，每天下班都到租房楼下的夫妻小饭店吃，店小实惠，比自己做饭买菜贵不了多少。老板的老爷子也在店里给他们看孩子，老爷子养了只八哥，才去时吃饭时，进门八哥总会说：欢迎光临，走时也会说：欢迎下次再来。不记得从什么时候开始，八哥不跟我打招呼了我走也不说话了，但是别人走它还说那两句话。昨晚饭后我问老爷子：为啥你的八哥不跟我打招了？老爷子说：你天天来吃，它把你当自家人了，我跟它说过自家人不用客气的，所以它就懒得理你了。我。。。换一家真没有这么便宜的饭菜。。。"}
{"author": "筱悦吧", "content": "同学婚礼现场，同学和他老婆太能说了！主持人几次想插话，都没有成功，终于，他们停了！主持人：这是多么有力的对白，这是多么恩爱的夫妻，在这个家庭里，小三连嘴都插不上，又岂能插上腿"}
{"author": "鲁智深暴打达文西", "content": "收条今收到梓涵2021年压岁钱4800元整，待其到18岁全不归还，特此声明。"}
{"author": "红尘一笑醉红颜～", "content": "和他开车出去玩的时候超速了，回来我拿我的驾照去给他扣分，工作人员问是你开的吗？我斩钉截铁地回答：是的。工作人员又问车是什么颜色，牌照多少我都一一回答了，最后问我知道在哪里超速的吗，我说怎么不知道，我坐边上一直看的导航呢，告诉他超速了超速了，减速都来不及了，气死我了.....工作人员说：你刚才不是说你开的吗……我....."}
{"author": "糗友kyY2eT", "content": "老张打了一通宵麻将，早上输了一万多元，看见一辆的士🚕，准备坐的士，转身一想，输入这么多，节约一点，坐摩的可以便宜一块钱，就坐了摩的。又想一夜未归，怕老婆骂，到菜场去买二颗白菜。用手一拿，白菜湿了好多水，然后就用手拼命甩，真甩了不少水，又可以便宜几毛钱了。"}
{"author": "梦爹爹", "content": "我今天吃鸡，匹配到了一个男生，声音跟我前任很像，简直一模一样，我突然不敢说话了，安静地听他说话，直到他说了一句话，我的眼泪就止不住了。他说的是“你跟我前女友一样菜....”"}
{"author": "老巫婆～～", "content": "侄子不会写日记，问我应该怎么写？我想了想告诉他，今天情人节呀，你就写有关情人节的事情呀！后来去看侄子写的日记，上面只有一句话：这是一个“没有情人的情人节”[捂脸][捂脸][捂脸]"}
{"author": "红尘一笑醉红颜～", "content": "经常遛弯的一处路边是鸟的天堂，每到傍晚时分成千上万只的鸟儿归林叽叽喳喳叫个不停，今天傍晚路过那里发现没有一只鸟叫声，奇怪的问老公：你说这些鸟都哪去了啊……他不假思索地回答：可能都回老家过年去了……"}
{"author": "骑着二哈啃黄瓜", "content": "同事给我闺蜜介绍相亲，相亲对象是同事堂哥，并互看了对方照片，都感觉还行。相亲那天，闺蜜带了一盒榴莲放到在前台，假如相亲不满意，就溜出来吃榴莲，用异味吓跑对方，避免首先提出不合适的尴尬。两人见面聊了五分钟挺投缘的，闺蜜很满意，一会儿男生说:失陪下​，接个电话!拿起手机就礼貌性出去了。闺蜜等了一会儿，感觉哪里不对劲，就朝前台走去看看啥情况，只见男生捧着着一盒臭豆腐捏着鼻子在吃。。。"}
